-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/Havard/Dropbox/Collaborations/PKO/Paper/Replication package/results/PKO
> sim/Log_PKO_sim_insamplev12.log
  log type:  text
 opened on:  28 Nov 2017, 15:04:49

. 
. local work_directory = c(pwd) /* Work directory is current directory */

. local results_directory = "`localpath'" + "`simsetname'"

. 
. display "`results_directory'"
C:\PredictionTemp\PKOsim

. capture mkdir "`results_directory'"

. 
. local mnos = wordcount("`models'") /* Number of models _and_ (maximum number of) columns 
> in matrix M */

. 
. local regiondatatemp = "`localpath'" + "`simsetname'" + "/Regions.dta"

. copy "Regions.dta" "`regiondatatemp'", replace

. 
. 
. 
. ****************************************************************
. **************************  New data  **************************
. ****************************************************************
. /* The following three lines may sometimes be omitted to save time */
. /*
> include "../../Data/Dofiles/_DataGenCountryYearMaster.do" /* Compiles data from original 
> sources */
> capture cd "../../Collaborations/PKO"
> save "InputData/SSPdata_temp.dta", replace
> */ 
. capture use "SSPdata_temp.dta"

. 
. include "AssembleDataPKO.do" /* Preparing data for SSP simulations */

. 
. ****************************************************************
. *********************  Assembling data *************************
. ****************************************************************
. 
. /* Stripping the data */ 
. keep gwno year conflict c0t c1t c2t lts* ltis timeinstatus timeindep countryname PopSSP* 
> GDPcapSSP* dec*  ///
>         PKO* UNMandate DS* changeSource* PSource Source polity2 TimeSinceRegimeChange2 Ti
> meSinceRegimeChange2_start TimeSinceRegimeChange3 ///
>         TimeSinceRegimeChange3_start TimeSinceRegimeChange4 TimeSinceRegimeChange4_start 
> PolityStdAuth NA_elect maj_elect pr_elect no_elect

.         
. 
. *keep gwno year conflict c0t c1t c2t lts* timeinstatus countryname gwabb timeindep PopSSP
> * GDPcapSSP* changeSource* PSource Source
. drop if year < 1950
(0 observations deleted)

. 
. replace conflict = 0 if conflict < 1 & conflict > 0
(0 real changes made)

. capture drop _merge

. *merge 1:1 gwno year using "../../Data/Temp/GDPCAPipolated.dta", keepusing(igdpPerCapita)
. 
. sort gwno

. by gwno: egen temp = count(conflict)

. tab gwno if temp == 0
no observations

. drop if temp == 0
(0 observations deleted)

. drop if year < 1960
(848 observations deleted)

. 
. replace conflict = 0 if conflict == .
(15,138 real changes made)

. replace c0t = 0 if c0t == .
(15,043 real changes made)

. replace c1t = 0 if c1t == .
(15,043 real changes made)

. replace c2t = 0 if c2t == .
(15,043 real changes made)

. gen c0 = c0t

. gen c1 = c1t

. gen c2 = c2t

. 
. gen c0_nl = 0 /* non-lagged version of c0 as suppvar*/  

. replace c0_nl = 1 if conflict == 0
(22,052 real changes made)

. 
. 
. /* Squared democracy (using a revised version of polity2) */
. gen polity2sq = polity2^2
(15,451 missing values generated)

. /* Interaction terms */
. gen polity2_polity2sq = polity2*polity2sq
(15,451 missing values generated)

. gen polity2_c0 = polity2*c0t
(15,451 missing values generated)

. gen polity2_c1 = polity2*c1t
(15,451 missing values generated)

. gen polity2_c2 = polity2*c2t
(15,451 missing values generated)

. 
. /* Remove international PKOs */
. 
. 
. foreach ds of varlist DS_* PKObudget PKOmandate {
  2.         replace `ds' = 0 if (UNMandate=="UNIIMOG" | UNMandate=="UNIKOM" | UNMandate=="
> UNMEE" | UNMandate=="UNMOGIP" | UNMandate=="UNTSO")
  3. }
(207 real changes made)
(207 real changes made)
(207 real changes made)

. 
. 
. 
. 
. /* Log transformations */
. /* Transformations of PKO variables*/
. gen PKOtrad = 0

. gen PKOtrans = 0

. replace PKOtrad = 1 if PKOmandate == 1 | PKOmandate == 2
(264 real changes made)

. replace PKOtrans = 1 if PKOmandate == 3 | PKOmandate == 4
(136 real changes made)

. gen lPKObudget = ln(PKObudget)
(23,004 missing values generated)

. replace lPKObudget = 0 if lPKObudget == . | lPKObudget < 0
(23,008 real changes made)

. gen lPKObudgsq = lPKObudget*lPKObudget

. 
. 
. forvalues i = 1(1)4 {
  2.         gen DS_ord_`i' = 0
  3.         replace DS_ord_`i' = 1 if DS_ordinal == `i'
  4. }
(137 real changes made)
(133 real changes made)
(36 real changes made)
(94 real changes made)

. include "regions.do"

. /*
> capture cd C:/Users/ARG/Dropbox/
> capture cd C:/Users/Hhegre/Dropbox/
> capture cd C:/Users/jonord/Dropbox/
> capture cd C:/Users/havnyg/Dropbox/
> 
> cd "Programs/Data"
> */
. capture drop smlreg

. gen smlreg = 0

. capture drop region

. gen region = 0

. capture label drop regions

. label define regions 1 "Southern Africa" 2 "Central/South America" 3 "West Europe" 4 "Eas
> t Europe" ///
>         5 "MENA" 6 "West Africa" 7 "East Africa" 8 "Central Asia" 9 "East/South Asia" 10 
> "Arab League" 11 "Non-Arab League"

. label values region regions

. 
. /* Region 1: Southern Africa */
. /* Smlreg 11: West Southern Africa; 12: South Southern Africa; 13: East Southern Africa *
> /
. /* 11: Angola Botswana Namibia Zambia */
. replace smlreg = 11 if gwno == 540 | gwno == 571 | gwno == 551 | gwno == 565 
(509 real changes made)

. /* 12: South S. Africa Lesotho Swaziland Zimbabwe */
. replace smlreg = 12 if gwno == 552 | gwno == 560| gwno == 570 | gwno == 572 
(545 real changes made)

. /* 13: Mozambique Comoros Malawi Madagascar Mauritius */
. replace smlreg = 13 if gwno == 580 | gwno == 581 | gwno == 590 | gwno == 541| gwno == 553
(663 real changes made)

. replace region = 1 if smlreg == 11 | smlreg == 12 | smlreg == 13
(1,717 real changes made)

. /* Region 2: Central/South America */
. /* 21: Caribbean: Bahamas Barbados Cuba Dominican Republic Haiti Jamaica Trinidad and Tob
> ago */
. replace smlreg = 21 if gwno == 31 | gwno == 40 | gwno == 41 | gwno == 42 | gwno == 51 | g
> wno == 52 | gwno == 53 
(964 real changes made)

. /* 22: Central America */
. replace smlreg = 22 if gwno == 70 | gwno == 80 | gwno == 90 | gwno == 91 | gwno == 92 | g
> wno == 93 | gwno == 94 | gwno == 95
(1,107 real changes made)

. /* 23: South America */
. replace smlreg = 23 if gwno == 100 | gwno == 101 | gwno == 110 | gwno == 115 | gwno == 13
> 0 | gwno == 135
(825 real changes made)

. replace smlreg = 23 if gwno == 140 | gwno == 145 | gwno == 150 | gwno == 155 | gwno == 16
> 0 | gwno == 165
(846 real changes made)

. replace region = 2 if smlreg == 21 | smlreg == 22 | smlreg == 23
(3,742 real changes made)

. replace smlreg = 22 if smlreg == 21 /* Merge Caribbean and Central America */
(964 real changes made)

. /* 3/31: West Europe */
. replace smlreg = 31 if gwno == 200 | gwno == 205 | gwno == 210 | gwno == 211 | gwno == 21
> 2 | gwno == 220 | gwno == 225 | gwno == 230 | gwno == 235 | gwno == 260
(1,410 real changes made)

. replace smlreg = 31 if gwno == 2 | gwno == 20
(282 real changes made)

. replace smlreg = 31 if gwno == 900 | gwno == 920
(282 real changes made)

. replace smlreg = 31 if gwno == 305 | gwno == 325 | gwno == 350 | gwno == 352
(564 real changes made)

. replace smlreg = 31 if gwno == 265 | gwno == 338
(137 real changes made)

. replace smlreg = 31 if gwno == 375 | gwno == 380 | gwno == 385 | gwno == 390 | gwno == 39
> 5
(705 real changes made)

. replace region = 3 if smlreg == 31
(3,380 real changes made)

. /* 4/41: East Europe */
. replace smlreg = 41 if gwno == 355 | gwno == 359 | gwno == 360 | gwno == 365 | gwno == 36
> 6 | gwno == 367 | gwno == 368 | gwno == 369 | gwno == 370
(1,083 real changes made)

. replace smlreg = 41 if gwno == 290 | gwno == 310 | gwno == 315 | gwno == 316 | gwno == 31
> 7 | gwno == 339 | gwno == 340 | gwno == 341 
(861 real changes made)

. replace smlreg = 41 if gwno == 343 | gwno == 344 | gwno == 345 | gwno == 346 | gwno == 34
> 7 | gwno == 349
(577 real changes made)

. replace region = 4 if smlreg == 41
(2,521 real changes made)

. /* 5: Middle East and North Africa */
. /* 51: North Africa */
. 
. replace smlreg = 51 if gwno == 600 | gwno == 615 | gwno == 616 | gwno == 620 | gwno == 62
> 5 | gwno == 651 
(844 real changes made)

. /* 52: Gulf countries */
. replace smlreg = 52 if  gwno == 670 | gwno == 678 | gwno == 680 | gwno == 690 | gwno == 6
> 92 | gwno == 694 | gwno == 696 | gwno == 698
(953 real changes made)

. /* 53: The Levant */
. replace smlreg = 53 if gwno == 640 | gwno == 645| gwno == 652 | gwno == 660 | gwno == 663
>  | gwno == 666
(846 real changes made)

. /* 54: Caucausus */
. replace smlreg = 54 if gwno == 371 | gwno == 372 | gwno == 373 
(330 real changes made)

. replace region = 5 if smlreg >= 51 & smlreg <=54
(2,973 real changes made)

. /* 6: West Africa */
. /* 61: Western West Africa */ 
. replace smlreg = 61 if gwno == 402 | gwno == 404 | gwno == 420 | gwno == 432 | gwno == 43
> 3 
(671 real changes made)

. replace smlreg = 61 if gwno == 435 | gwno == 437 | gwno == 438 | gwno == 450 | gwno == 45
> 1 
(704 real changes made)

. /* 62: Easter West Africa */
. replace smlreg = 62 if  gwno == 434 | gwno == 436 | gwno == 439| gwno == 452 | gwno == 46
> 1 | gwno == 475
(846 real changes made)

. replace region = 6 if smlreg == 61 | smlreg == 62
(2,221 real changes made)

. /* 7: Central and Eastern Africa */
. /* 71: Central Africa */
. replace smlreg = 71 if gwno == 411 | gwno == 471 | gwno == 481 | gwno == 482 | gwno == 48
> 3 | gwno == 484
(838 real changes made)

. /* 72: Eastern central Africa */
. replace smlreg = 72 if gwno == 490 | gwno == 500 | gwno == 501 | gwno == 510 | gwno == 51
> 6 | gwno == 517 | gwno == 626  
(926 real changes made)

. /* 73: The Horn */
. replace smlreg = 73 if gwno == 522 | gwno == 530 | gwno == 531 | gwno == 511 | gwno == 52
> 0 
(514 real changes made)

. replace region = 7 if smlreg == 71 | smlreg == 72 | smlreg == 73
(2,278 real changes made)

. /* 8: South Asia */
. /* 81: Pakistan, Iran, Afghanistan */
. replace smlreg = 81 if gwno == 630 | gwno == 700 | gwno == 770
(423 real changes made)

. /* 82: Other -stans */
. replace smlreg = 82 if gwno == 701 | gwno == 702 | gwno == 703 | gwno == 704 | gwno == 70
> 5
(550 real changes made)

. /* 83: South Asia */
. replace smlreg = 83 if gwno == 750 | gwno == 760 | gwno == 771 | gwno == 775 | gwno == 78
> 0 | gwno == 781 | gwno == 790 
(971 real changes made)

. replace region = 8 if smlreg == 81 | smlreg == 82 | smlreg == 83
(1,944 real changes made)

. /* 9: East Asia */
. /* 91: North East */
. replace smlreg = 91 if gwno == 710 | gwno == 712 | gwno == 713 | gwno == 731 | gwno == 73
> 2 | gwno == 740 | gwno == 840  
(987 real changes made)

. /* 92: Indochina */
. replace smlreg = 92 if gwno == 800 | gwno == 811 | gwno == 812 | gwno == 816 | gwno == 81
> 7
(564 real changes made)

. /* 93: The islands */
. replace smlreg = 93 if gwno == 820 | gwno == 830 | gwno == 835 | gwno == 850 | gwno == 86
> 0 | gwno == 910 | gwno == 940 | gwno == 950
(1,014 real changes made)

. replace region = 9 if smlreg >= 91 & smlreg <=93
(2,565 real changes made)

. /*
> /* Arab consequences version */
> replace region = 10 if (gwno == 615 | gwno == 692 | gwno == 581 | gwno == 522 | gwno == 6
> 51 | ///
>         gwno == 645 | gwno == 663 | gwno == 690 | gwno == 660 | gwno == 620 | ///
>         gwno == 435 | gwno == 600 | gwno == 698 | gwno == 694 | ///
>         gwno == 670 | gwno == 520 | gwno == 625 | gwno == 652 | gwno == 616 | ///
>         gwno == 696 | gwno == 678 )
>         
> replace region = 11 if region != 10
> drop if gwno == 626
> 
> */
. 
. capture drop regmarker

. gen regmarker = 0

. replace regmarker = 1 if gwno == 560 & region == 1
(141 real changes made)

. replace regmarker = 1 if gwno == 100 & region == 2
(141 real changes made)

. replace regmarker = 1 if gwno == 200 & region == 3
(141 real changes made)

. replace regmarker = 1 if gwno == 290 & region == 4
(141 real changes made)

. replace regmarker = 1 if gwno == 600 & region == 5
(141 real changes made)

. replace regmarker = 1 if gwno == 475 & region == 6
(141 real changes made)

. replace regmarker = 1 if gwno == 500 & region == 7
(139 real changes made)

. replace regmarker = 1 if gwno == 750 & region == 8
(141 real changes made)

. replace regmarker = 1 if gwno == 710 & region == 9
(141 real changes made)

. replace regmarker = 1 if gwno == 651 & region == 10
(0 real changes made)

. replace regmarker = 1 if gwno == 2 & region == 11
(0 real changes made)

. 
. /* Dummy region variables */
. forvalues r = 1(1)11 {
  2.         capture drop reg`r'
  3.         gen reg`r' = 0
  4.         replace reg`r' = 1 if region == `r'
  5. }
(1,717 real changes made)
(3,742 real changes made)
(3,380 real changes made)
(2,521 real changes made)
(2,973 real changes made)
(2,221 real changes made)
(2,278 real changes made)
(1,944 real changes made)
(2,565 real changes made)
(0 real changes made)
(0 real changes made)

. 
. /*
> keep gwno year reg*
> drop if year != 2013
> */
. save Regions, replace
file Regions.dta saved

. 
. *tab region conflict  if year >= 1960 & year <= 2000
. 
. /* Code the neighborhood variables */
. 
. /* Code conflict neighborhood */
. nblag_v2 conflict, primkey(gwno year) neighborfile("smallmdd_test.dta") limit(0) prefix(n
> b_) op(max) 
Neighborfile: smallmdd_test.dta
Merge variables: Geographical: gwno, temporal: year
Prefix for resulting neighborhood variable: nb_
Maximum distance defining neighborhood: 0
file /var/folders/pp/ckt6y1kj0mb6_c48bwlth0t80000gn/T//S_29648.000002 saved

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     mindist |    101,068           0           0          0          0

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     15,348       14.98       14.98
          2 |      1,369        1.34       16.32
          3 |     85,720       83.68      100.00
------------+-----------------------------------
      Total |    102,437      100.00
(1,369 observations deleted)
(99,356 real changes made)
HERE
file /var/folders/pp/ckt6y1kj0mb6_c48bwlth0t80000gn/T//S_29648.000001 saved

. replace nb_conflict = 0 if nb_conflict == . /* If missing, set conflict in neighborhood t
> o 0 (probably due to no neighbors) */
(6,169 real changes made)

. label var nb_conflict "Neighboring incidence of conflict from UCDP (extended with COW bef
> ore 1946)"

. 
. nblag_v2 PKOtrans, primkey(gwno year) neighborfile("smallmdd_test.dta") limit(0) prefix(n
> b_) op(max) 
Neighborfile: smallmdd_test.dta
Merge variables: Geographical: gwno, temporal: year
Prefix for resulting neighborhood variable: nb_
Maximum distance defining neighborhood: 0
file /var/folders/pp/ckt6y1kj0mb6_c48bwlth0t80000gn/T//S_29648.000002 saved

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     mindist |    101,068           0           0          0          0

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |      1,369        1.34        1.34
          3 |    101,068       98.66      100.00
------------+-----------------------------------
      Total |    102,437      100.00
(1,369 observations deleted)
(99,356 real changes made)
HERE
file /var/folders/pp/ckt6y1kj0mb6_c48bwlth0t80000gn/T//S_29648.000001 saved

. replace nb_PKOtrans = 0 if nb_PKOtrans == . /* If missing, set conflict in neighborhood t
> o 0 (probably due to no neighbors) */
(6,169 real changes made)

. label var nb_PKOtrans "Presence of transformational PKO in neighboring country"

. rename nb_PKOtrans PKOneighbor 

. 
. *capture drop n
. *by gwno year, sort: gen n =_n
. *keep if n == 1
. capture drop nc1 nc2 nc1c1 nc1c2 nc1ts0 nc2c1 nc2c2 nc2ts0 

. capture drop nc ncc1 ncc2 ncts0

. replace nb_conflict = 0 if year == `sim_lyear' + 1
(0 real changes made)

. quietly gen nc = nb_conflict >= 1

. quietly gen nc0 = nb_conflict == 0

. quietly gen nc1 = nb_conflict == 1

. quietly gen nc2 = nb_conflict == 2

. quietly gen nc1c1 = nc1 * c1

. quietly gen nc1c2 = nc1 * c2

. quietly gen nc1ts0 = nc1 * ltsc0

. quietly gen nc2c1 = nc2 * c1

. quietly gen nc2c2 = nc2 * c2

. quietly gen nc2ts0 = nc2 * ltsc0

. quietly gen ncc1 = nc * c1

. quietly gen ncc2 = nc * c2

. quietly gen ncts0 = nc0 * ltsc0

. quietly gen nc2l = nc[_n-1]  if gwno==gwno[_n-1]

. list gwno year conflict c1 c2 nc if (gwno == 432 | gwno == 433 | gwno == 435 | gwno == 43
> 6 | gwno == 482 | gwno == 483 |  gwno == 501 | gwno == 522 | gwno == 530 | gwno == 531 | 
> gwno == 600 | gwno == 615 | gwno == 616 | gwno == 620 | gwno == 625 | gwno == 630 | gwno 
> == 640 | gwno == 645 | gwno == 651 | gwno == 652 | gwno == 660 | gwno == 663 | gwno == 66
> 6 | gwno == 670 | gwno == 678 | gwno == 690) & (year >= 2012 & year <= 2013)

       +---------------------------------------+
       | gwno   year   conflict   c1   c2   nc |
       |---------------------------------------|
13982. |  432   2012          1    0    0    1 |
13983. |  432   2013          1    1    0    1 |
14123. |  433   2012          0    1    0    1 |
14124. |  433   2013          0    0    0    1 |
14405. |  435   2012          0    1    0    1 |
       |---------------------------------------|
14406. |  435   2013          0    0    0    1 |
14546. |  436   2012          0    0    0    1 |
14547. |  436   2013          0    0    0    1 |
16100. |  482   2012          1    1    0    1 |
16101. |  482   2013          1    1    0    1 |
       |---------------------------------------|
16241. |  483   2012          0    0    0    1 |
16242. |  483   2013          0    0    0    1 |
16800. |  501   2012          0    0    0    1 |
16801. |  501   2013          0    0    0    1 |
17483. |  522   2012          0    0    0    1 |
       |---------------------------------------|
17484. |  522   2013          0    0    0    1 |
17628. |  530   2012          1    1    0    1 |
17629. |  530   2013          1    1    0    1 |
17736. |  531   2012          0    0    0    1 |
17737. |  531   2013          0    0    0    1 |
       |---------------------------------------|
19667. |  600   2012          0    0    0    1 |
19668. |  600   2013          0    0    0    1 |
19806. |  615   2012          1    1    0    1 |
19807. |  615   2013          1    1    0    1 |
19951. |  616   2012          0    0    0    1 |
       |---------------------------------------|
19952. |  616   2013          0    0    0    1 |
20101. |  620   2012          0    0    1    1 |
20102. |  620   2013          0    0    0    1 |
20246. |  625   2012          2    0    1    1 |
20247. |  625   2013          1    0    1    1 |
       |---------------------------------------|
20562. |  630   2012          0    1    0    1 |
20563. |  630   2013          0    0    0    1 |
20788. |  640   2012          1    1    0    1 |
20789. |  640   2013          1    1    0    1 |
20957. |  645   2012          1    1    0    1 |
       |---------------------------------------|
20958. |  645   2013          2    1    0    1 |
21126. |  651   2012          0    0    0    1 |
21127. |  651   2013          0    0    0    1 |
21281. |  652   2012          2    1    0    1 |
21282. |  652   2013          2    0    1    1 |
       |---------------------------------------|
21436. |  660   2012          0    0    0    1 |
21437. |  660   2013          0    0    0    1 |
21591. |  663   2012          0    0    0    1 |
21592. |  663   2013          0    0    0    1 |
21744. |  666   2012          1    1    0    1 |
       |---------------------------------------|
21745. |  666   2013          0    1    0    1 |
21913. |  670   2012          0    0    0    1 |
21914. |  670   2013          0    0    0    1 |
22082. |  678   2012          2    0    1    0 |
22083. |  678   2013          1    0    1    0 |
       |---------------------------------------|
22246. |  690   2012          0    0    0    1 |
22247. |  690   2013          0    0    0    1 |
       +---------------------------------------+

. 
. /* Redo this based on the nblag_v2 statement below? */
. sort gwno year

. capture drop timeinstatusnc

. gen timeinstatusnc=0 if (gwno!=gwno[_n-1]) | year < 1950
(24,123 missing values generated)

. replace timeinstatusnc=0 if (gwno==gwno[_n-1]) & (nc[_n-0]!=nc[_n-1])
(779 real changes made)

. replace timeinstatusnc=timeinstatusnc[_n-1]+1 if (gwno==gwno[_n-1]) & (nc[_n-0]==nc[_n-1]
> ) & timeinstatusnc==.
(23,344 real changes made)

. replace timeinstatusnc=timeinstatusnc+1 /* Add 1 to facilitate log transformation (???) *
> /
(28,222 real changes made)

. capture drop ltisnc

. gen ltisnc = timeinstatusnc[_n-1] if gwno==gwno[_n-1]
(186 missing values generated)

. 
. gen ltsnc = ln(ltisnc) /* Log of number of years in peace in all neighboring countries */
(186 missing values generated)

. 
. 
. /* Log transform; Generate interactions between pop, gdp, decades, and conflict */
. gen ltimeindep = ln(timeindep)
(4,967 missing values generated)

. disp "here"
here

. 
.         *preserve
.         gen lpop = ln(PopSSP2)
(4,881 missing values generated)

.         gen lGDPcap = ln(GDPcapSSP2)
(4,908 missing values generated)

.         /* Variable for endogenous growth equation */
.         sort gwno year

.         quietly gen loggdpgrowth = .

.         quietly replace loggdpgrowth = lGDPcap - lGDPcap[_n-1] if gwno == gwno[_n-1]

.         gen lpop_c1 = lpop * c1
(4,881 missing values generated)

.         gen lpop_c2 = lpop * c2
(4,881 missing values generated)

.         gen lpop_ltsc0 = lpop * ltsc0
(4,881 missing values generated)

.         gen lGDPcap_c1 = lGDPcap * c1
(4,908 missing values generated)

.         gen lGDPcap_c2 = lGDPcap * c2
(4,908 missing values generated)

.         gen lGDPcap_ltsc0 = lGDPcap * ltsc0
(4,908 missing values generated)

.         gen polity2_GDPcap = polity2 * lGDPcap
(20,354 missing values generated)

.         gen polity2sq_GDPcap = polity2sq * lGDPcap
(20,354 missing values generated)

.         gen polity2sq_c1 = polity2sq * c1t
(20,332 missing values generated)

.         gen polity2sq_c2 = polity2sq * c2t
(20,332 missing values generated)

.         
.         foreach d in 60 70 80 90 {
  2.                 gen dec`d'_lpop = dec`d' * lpop
  3.                 gen dec`d'_lGDPcap = dec`d' * lGDPcap
  4.         } /* end foreach d */
(4,881 missing values generated)
(4,908 missing values generated)
(4,881 missing values generated)
(4,908 missing values generated)
(4,881 missing values generated)
(4,908 missing values generated)
(4,881 missing values generated)
(4,908 missing values generated)

.         drop if year < 1960
(4,800 observations deleted)

.         
.         by gwno: gen llGDPcap = lGDPcap[_n-1]
(283 missing values generated)

. replace lGDPcap = llGDPcap      
(23,308 real changes made, 176 to missing)

.         
. /* Remove countries that involve missing-data problems */
. /* Zanzibar, Palestine, Yemen, People's Republic of and Vietnam, Republic of */
. quietly drop if gwno == 511 | gwno == 667 | gwno == 680 | gwno == 817

. /* Microstates: Bahamas, Barbados, Belize, Malta, Iceland, Maldives, Brunei */
. quietly drop if gwno == 31 | gwno == 53 | gwno == 80 | gwno== 338 | gwno == 395 | gwno ==
>  781 | gwno == 835

. /* Defunct states: Czechoslovakia and Serbia/Yugoslavia and Germany and 711 */
. quietly drop if gwno == 315 | gwno == 345 | gwno == 265 | gwno == 711

. 
. /* Missing data for Polity because of different independence definitions */
. drop if gwno == 552 & year <= 1969 /* Zimbabwe (Rhodesia) */
(5 observations deleted)

. drop if gwno == 771 & year == 1971 /* Bangladesh */
(1 observation deleted)

. drop if gwno == 690 & year <= 1962 /* Kuwait */
(2 observations deleted)

. drop if gwno == 452     & year <=1959 /* Ghana */
(0 observations deleted)

. drop if gwno == 616     & year <=1958 /* Tunisia */
(0 observations deleted)

. drop if gwno == 817     & year == 1954 /* Vietnam, Republic of */
(0 observations deleted)

. 
. 
. 
. /* Remove countries that create problems in simulations for out-of-sample evaluation  */
. if `sim_fyear' < 2011 {
.         drop if gwno == 626 /* South Sudan */
(90 observations deleted)
. }

. if `sim_fyear' < 2008 {
.         drop if gwno == 347 /* Kosovo */
(93 observations deleted)
. }

. if `sim_fyear' < 2006 {
.         drop if gwno == 345 | gwno == 340 | gwno == 341 /* Serbia and Montenegro */
(190 observations deleted)
. }

. if `sim_fyear' < 2002 {
.         drop if gwno == 860 /* East Timor */
(99 observations deleted)
. }

. if `sim_fyear' < 1994 {
.         drop if gwno == 315 | gwno = 316 | gwno == 317 | gwno == 531 /* Czechoslovakia, C
> zekh Rep., Slovakia, Eritrea */
. }

. 
. drop if gwno == 626 /* Drop it anyhow; no growth projections available just now */
(0 observations deleted)

. 
. /* Take out some country years with missing data  */
. drop if gwno == 411 & year <= 1967
(8 observations deleted)

. drop if gwno == 760 & year <= 1969
(10 observations deleted)

. drop if gwno == 940 & year <= 1989
(12 observations deleted)

. drop if gwno == 349 & year == 1991
(1 observation deleted)

.         
. drop if gwno == . | year == .
(0 observations deleted)

. 
. /* No pko variable as constraint on scenarios */
. 
. gen nopko = 0

. replace nopko = 1 if (gwno == 2 | gwno == 200 | gwno == 220 | gwno == 365 | gwno == 710) 
> /* UNSC permanent members */
(705 real changes made)

. replace nopko = 1 if (gwno == 70 | gwno == 140 | gwno == 475 | gwno == 740 | gwno == 750 
> | gwno == 770 | gwno == 771 | gwno == 850) /* UNSC permanent members */
(1,116 real changes made)

. tab gwno if year == 2013 & nopko == 1

Gleditsch & |
       Ward |
    country |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |          1        7.69        7.69
         70 |          1        7.69       15.38
        140 |          1        7.69       23.08
        200 |          1        7.69       30.77
        220 |          1        7.69       38.46
        365 |          1        7.69       46.15
        475 |          1        7.69       53.85
        710 |          1        7.69       61.54
        740 |          1        7.69       69.23
        750 |          1        7.69       76.92
        770 |          1        7.69       84.62
        771 |          1        7.69       92.31
        850 |          1        7.69      100.00
------------+-----------------------------------
      Total |         13      100.00

. 
. gen lPKObudgetmarker = 0

. replace lPKObudgetmarker = 1 if lPKObudget > 0
(310 real changes made)

. replace PKOprevious = 0 if PKOprevious == .
(21,264 real changes made)

. 
. include "RotatingSecurityCouncilMembership.do"

. /*********************************************************/
. /**** This do file generates a dummy marking whether *****/
. /**** a country in that year is a rotating member on *****/
. /**** the UN sec. concil. Permanent members are coded ****/
. /**** 1 throughout.                                                               ****/
. /**** Version 1.0 updated 04.01.2015 by HŒvard MN     ****/  
. /*********************************************************/
. 
. gen securitycouncilmember = 0

. label var securitycouncilmember "Rotating member of UN Sec. Council"

. 
. replace securitycouncilmember = 1 if gwno == 615 & year >= 1968 & year <= 1969  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 615 & year >= 1988 & year <= 1989 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 615 & year >= 2004 & year <= 2005 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 540 & year >= 2003 & year <= 2004 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 540 & year >= 2015 & year <= 2016 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 160 & year >= 1948 & year <= 1949 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 160 & year >= 1959 & year <= 1960 
(1 real change made)

. replace securitycouncilmember = 1 if gwno == 160 & year >= 1966 & year <= 1967 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 160 & year >= 1971 & year <= 1972 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 160 & year >= 1987 & year <= 1988 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 160 & year >= 1994 & year <= 1995 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 160 & year >= 1999 & year <= 2000 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 160 & year >= 2005 & year <= 2006 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 160 & year >= 2013 & year <= 2014 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 900  & year >= 2013 & year <= 2014 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 900  & year >= 1946 & year <= 1947 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 900  & year >= 1956 & year <= 1957 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 900  & year >= 1973 & year <= 1974 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 900  & year >= 1985 & year <= 1986 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 305   & year >= 1973 & year <= 1974 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 305   & year >= 1991 & year <= 1992 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 305   & year >= 2009 & year <= 2010 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 373   & year >= 2012 & year <= 2013  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 692   & year >= 1998 & year <= 1999  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 771  & year >= 1979 & year <= 1980 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 771  & year >= 2000 & year <= 2001   
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 370  & year >= 1974 & year <= 1975  
(0 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 211  & year >= 1947 & year <= 1948 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 211  & year >= 1955 & year <= 1956  
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 211  & year >= 1971 & year <= 1972  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 211  & year >= 1991 & year <= 1992  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 211  & year >= 2007 & year <= 2008   
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 434 & year >= 1976 & year <= 1977 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 434 & year >= 2004 & year <= 2005  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 145 & year >= 1964 & year <= 1965  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 145 & year >= 1978 & year <= 1979  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 346 & year >= 2010 & year <= 2011 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 571 & year >= 1995 & year <= 1996 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 140 & year >= 1946 & year <= 1947 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 140 & year >= 1951 & year <= 1952 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 140 & year >= 1954 & year <= 1955 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 140 & year >= 1963 & year <= 1964 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 140 & year >= 1967 & year <= 1968 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 140 & year >= 1988 & year <= 1989 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 140 & year >= 1993 & year <= 1994 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 140 & year >= 1998 & year <= 1999 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 140 & year >= 2004 & year <= 2005 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 140 & year >= 2010 & year <= 2011 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 355 & year >= 1966 & year <= 1967 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 355 & year >= 1986 & year <= 1987 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 355 & year >= 2002 & year <= 2003 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 439 & year >= 1984 & year <= 1985  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 439 & year >= 2008 & year <= 2009  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 516 & year >= 1970 & year <= 1971   
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 402 & year >= 1992 & year <= 1993  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 471 & year >= 1974 & year <= 1975  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 471 & year >= 2002 & year <= 2003
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 20 & year >= 1948 & year <= 1949 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 20 & year >= 1958 & year <= 1959 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 20 & year >= 1967 & year <= 1968 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 20 & year >= 1977 & year <= 1978 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 20 & year >= 1989 & year <= 1990 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 20 & year >= 1999 & year <= 2000 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 483 & year >= 2014 & year <= 2015  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 155 & year >= 1952 & year <= 1953
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 155 & year >= 1961 & year <= 1962  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 155 & year >= 1996 & year <= 1997  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 155 & year >= 2003 & year <= 2004  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 155 & year >= 2014 & year <= 2015    
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 710
(141 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 100 & year >= 1947 & year <= 1948  
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 100 & year >= 1953 & year <= 1954 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 100 & year >= 1957 & year <= 1958 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 100 & year >= 1969 & year <= 1970 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 100 & year >= 1989 & year <= 1990 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 100 & year >= 2001 & year <= 2002 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 100 & year >= 2011 & year <= 2012 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 484 & year >= 1986 & year <= 1987 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 484 & year >= 2006 & year <= 2007
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 94 & year >= 1975 & year <= 1974
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 94 & year >= 1997 & year <= 1998
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 94 & year >= 2008 & year <= 2009
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 437 & year >= 1964 & year <= 1965
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 437 & year >= 1990 & year <= 1991
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 344 & year >= 2008 & year <= 2009 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 40 & year >= 1949 & year <= 1950
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 40 & year >= 1956 & year <= 1957  
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 40 & year >= 1990 & year <= 1991    
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 316 & year >= 1994 & year <= 1995
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 315 & year >= 1964 & year <= 1965 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 315 & year >= 1978 & year <= 1979 
(0 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 490 & year >= 1982 & year <= 1983 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 490 & year >= 1990 & year <= 1991   
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 390 & year >= 1953 & year <= 1954  
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 390 & year >= 1967 & year <= 1968  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 390 & year >= 1985 & year <= 1986  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 390 & year >= 2005 & year <= 2006    
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 522 & year >= 1993 & year <= 1994  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 130 & year >= 1950 & year <= 1951 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 130 & year >= 1960 & year <= 1961 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 130 & year >= 1991 & year <= 1992
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 651 & year == 1946
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 651 & year >= 1949 & year <= 1950 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 651 & year >= 1984 & year <= 1985 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 651 & year >= 1996 & year <= 1997 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 530 & year >= 1967 & year <= 1968  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 530 & year >= 1989 & year <= 1990  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 375 & year >= 1969 & year <= 1970 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 375 & year >= 1989 & year <= 1990 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 220
(141 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 481 & year >= 1978 & year <= 1979 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 481 & year >= 1998 & year <= 1999 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 481 & year >= 2010 & year <= 2011 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 420 & year >= 1998 & year <= 1999  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 260 & year >= 1977 & year <= 1978 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 260 & year >= 1987 & year <= 1988 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 260 & year >= 1995 & year <= 1996 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 260 & year >= 2003 & year <= 2004 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 260 & year >= 2011 & year <= 2012  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 452 & year >= 1962 & year <= 1963   
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 452 & year >= 1986 & year <= 1987  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 452 & year >= 2006 & year <= 2007  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 350 & year >= 1952 & year <= 1953 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 350 & year >= 2005 & year <= 2006 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 90 & year >= 2012 & year <= 2013
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 438 & year >= 1972 & year <= 1973 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 438 & year >= 2002 & year <= 2003 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 404 & year >= 1996 & year <= 1997 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 110 & year >= 1975 & year <= 1976 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 110 & year >= 1982 & year <= 1983 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 91 & year >= 1995 & year <= 1996
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 310 & year >= 1968 & year <= 1969 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 310 & year >= 1992 & year <= 1993 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 750 & year >= 1950 & year <= 1951  
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 750 & year >= 1967 & year <= 1968  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 750 & year >= 1972 & year <= 1973  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 750 & year >= 1977 & year <= 1978  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 750 & year >= 1984 & year <= 1985  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 750 & year >= 1991 & year <= 1992  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 750 & year >= 2011 & year <= 2012  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 850 & year >= 1973 & year <= 1974   
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 850 & year >= 1995 & year <= 1996 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 850 & year >= 2007 & year <= 2008 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 630 & year >= 1955 & year <= 1956  
(0 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 645 & year >= 1957 & year <= 1958  
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 645 & year >= 1974 & year <= 1975 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 205 & year == 1962
(1 real change made)

. replace securitycouncilmember = 1 if gwno == 205 & year >= 1981 & year <= 1982 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 205 & year >= 2001 & year <= 2002 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 325 & year >= 1959 & year <= 1960 
(1 real change made)

. replace securitycouncilmember = 1 if gwno == 325 & year >= 1971 & year <= 1972 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 325 & year >= 1975 & year <= 1976 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 325 & year >= 1987 & year <= 1988 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 325 & year >= 1995 & year <= 1996 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 325 & year >= 2007 & year <= 2008 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 51 & year >= 1979 & year <= 1980  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 51 & year >= 2000 & year <= 2001  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 740 & year >= 1958 & year <= 1959 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 740 & year >= 1966 & year <= 1967 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 740 & year >= 1971 & year <= 1972 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 740 & year >= 1975 & year <= 1976 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 740 & year >= 1981 & year <= 1982 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 740 & year >= 1987 & year <= 1988 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 740 & year >= 1992 & year <= 1993 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 740 & year >= 1997 & year <= 1998 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 740 & year >= 2005 & year <= 2006 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 740 & year >= 2009 & year <= 2010  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 663 & year >= 1965 & year <= 1966  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 663 & year >= 1982 & year <= 1983  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 663 & year >= 2014 & year <= 2015  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 501 & year >= 1973 & year <= 1974 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 501 & year >= 1997 & year <= 1998  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 690 & year >= 1978 & year <= 1979  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 660 & year >= 1953 & year <= 1954  
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 660 & year >= 2010 & year <= 2011     
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 450 & year == 1961 
(1 real change made)

. 
. replace securitycouncilmember = 1 if gwno == 620 & year >= 1976 & year <= 1977 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 620 & year >= 2008 & year <= 2009     
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 368 & year >= 2014 & year <= 2015
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 212 & year >= 2013 & year <= 2014
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 580 & year >= 1985 & year <= 1986
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 820 & year == 1965
(1 real change made)

. replace securitycouncilmember = 1 if gwno == 820 & year >= 1989 & year <= 1990
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 820 & year >= 1999 & year <= 2000
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 820 & year >= 2015 & year <= 2016
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 432 & year >= 1966 & year <= 1967 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 432 & year >= 2000 & year <= 2001 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 338 & year >= 1983 & year <= 1984  
(0 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 435 & year >= 1974 & year <= 1975   
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 590 & year >= 1977 & year <= 1978
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 590 & year >= 2001 & year <= 2002    
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 70 & year == 1946
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 70 & year >= 1980 & year <= 1981 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 70 & year >= 2002 & year <= 2003 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 70 & year >= 2009 & year <= 2010 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 600 & year >= 1963 & year <= 1964  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 600 & year >= 1992 & year <= 1993  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 600 & year >= 2012 & year <= 2013  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 565 & year >= 1999 & year <= 2000  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 790 & year >= 1969 & year <= 1970
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 790 & year >= 1988 & year <= 1989  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 210 & year == 1946
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 210 & year >= 1951 & year <= 1952  
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 210 & year >= 1965 & year <= 1966  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 210 & year >= 1983 & year <= 1984  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 210 & year >= 1999 & year <= 2000    
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 920 & year >= 1954 & year <= 1955
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 920 & year == 1966 
(1 real change made)

. replace securitycouncilmember = 1 if gwno == 920 & year >= 1993 & year <= 1994  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 920 & year >= 2015 & year <= 2016    
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 93 & year >= 1970 & year <= 1971 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 93 & year >= 1983 & year <= 1984 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 436 & year >= 1980 & year <= 1981
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 475 & year >= 1966 & year <= 1967
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 475 & year >= 1978 & year <= 1979 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 475 & year >= 1994 & year <= 1995 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 475 & year >= 2010 & year <= 2011 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 475 & year >= 2014 & year <= 2015  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 385 & year >= 1949 & year <= 1950
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 385 & year >= 1963 & year <= 1964 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 385 & year >= 1979 & year <= 1980 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 385 & year >= 2001 & year <= 2002  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 698 & year >= 1994 & year <= 1995 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 770 & year >= 1952 & year <= 1953
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 770 & year >= 1968 & year <= 1969 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 770 & year >= 1976 & year <= 1977 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 770 & year >= 1983 & year <= 1984 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 770 & year >= 1993 & year <= 1994 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 770 & year >= 2003 & year <= 2004
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 770 & year >= 2012 & year <= 2013
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 95 & year >= 1958 & year <= 1959
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 95 & year >= 1972 & year <= 1973
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 95 & year >= 1976 & year <= 1977
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 95 & year >= 1981 & year <= 1982
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 95 & year >= 2007 & year <= 2008
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 150 & year >= 1968 & year <= 1969 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 135 & year >= 1955 & year <= 1956
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 135 & year >= 1973 & year <= 1974 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 135 & year >= 1984 & year <= 1985 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 135 & year >= 2006 & year <= 2007  
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 840 & year == 1957
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 840 & year == 1963
(1 real change made)

. replace securitycouncilmember = 1 if gwno == 840 & year >= 1980 & year <= 1981  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 840 & year >= 2004 & year <= 2005    
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 290 & year >= 1946 & year <= 1947 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 290 & year == 1960
(1 real change made)

. replace securitycouncilmember = 1 if gwno == 290 & year >= 1970 & year <= 1971 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 290 & year >= 1982 & year <= 1983 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 290 & year >= 1996 & year <= 1997 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 235 & year >= 1979 & year <= 1980
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 235 & year >= 1997 & year <= 1998 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 235 & year >= 2011 & year <= 2012 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 694  & year >= 2006 & year <= 2007
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 732 & year >= 1996 & year <= 1997 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 732 & year >= 2013 & year <= 2014 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 360 & year == 1962 
(1 real change made)

. replace securitycouncilmember = 1 if gwno == 360 & year >= 1976 & year <= 1977  
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 360 & year >= 1990 & year <= 1991 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 360 & year >= 2004 & year <= 2005   
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 365
(141 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 517 & year >= 1994 & year <= 1995
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 517 & year >= 2013 & year <= 2014
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 433 & year >= 1968 & year <= 1969 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 433 & year >= 1988 & year <= 1989 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 451  & year >= 1970 & year <= 1971
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 830 & year >= 2001 & year <= 2003
(3 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 317 & year >= 2006 & year <= 2007
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 349 & year >= 1998 & year <= 1999
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 520 & year >= 1971 & year <= 1972 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 560 & year >= 2007 & year <= 2008
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 560 & year >= 2011 & year <= 2012
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 230 & year >= 1969 & year <= 1970 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 230 & year >= 1981 & year <= 1982 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 230 & year >= 1993 & year <= 1994 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 230 & year >= 2003 & year <= 2004 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 230 & year >= 2015 & year <= 2016 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 780 & year >= 1960 & year <= 1961
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 625 & year >= 1972 & year <= 1973
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 380 & year >= 1957 & year <= 1958
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 380 & year >= 1975 & year <= 1976
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 380 & year >= 1997 & year <= 1998
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 652 & year >= 1947 & year <= 1948
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 652 & year >= 1970 & year <= 1971
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 652 & year >= 2002 & year <= 2003
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 800 & year >= 1985 & year <= 1986
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 461 & year >= 1982 & year <= 1983
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 461 & year >= 2012 & year <= 2013
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 52 & year >= 1985 & year <= 1986 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 616 & year >= 1959 & year <= 1960  
(1 real change made)

. replace securitycouncilmember = 1 if gwno == 616 & year >= 1980 & year <= 1981 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 616 & year >= 2000 & year <= 2001 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 640 & year >= 1951 & year <= 1952
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 640 & year >= 1954 & year <= 1955  
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 640 & year == 1961
(1 real change made)

. replace securitycouncilmember = 1 if gwno == 640 & year >= 2009 & year <= 2010    
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 500 & year == 1966
(1 real change made)

. replace securitycouncilmember = 1 if gwno == 500 & year >= 1981 & year <= 1982
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 500 & year >= 2009 & year <= 2010
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 369 & year >= 1948 & year <= 1949
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 369 & year >= 1984 & year <= 1985 
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 369 & year >= 2000 & year <= 2001 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 696 & year >= 1986 & year <= 1987
(2 real changes made)

. 
. *replace securitycouncilmember = 1 if gwno == United Arab Republic 
. *1961 Ğ 1962
. 
. replace securitycouncilmember = 1 if gwno == 200
(141 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 510 & year >= 1975 & year <= 1976
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 510 & year >= 2005 & year <= 2006
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 2
(141 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 165 & year >= 1965 & year <= 1966 
(2 real changes made)

. 
. 
. replace securitycouncilmember = 1 if gwno == 101 & year >= 1962 & year <= 1963
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 101 & year >= 1977 & year <= 1978
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 101 & year >= 1986 & year <= 1987
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 101 & year >= 1992 & year <= 1993
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 101 & year >= 2015 & year <= 2016
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 816 & year >= 2008 & year <= 2009
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 678 & year >= 1990 & year <= 1991 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 345 & year >= 1950 & year <= 1951
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 345 & year == 1956
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 345 & year >= 1972 & year <= 1973
(0 real changes made)

. replace securitycouncilmember = 1 if gwno == 345 & year >= 1988 & year <= 1989
(0 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 551 & year >= 1969 & year <= 1970 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 551 & year >= 1979 & year <= 1980 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 551 & year >= 1987 & year <= 1988 
(2 real changes made)

. 
. replace securitycouncilmember = 1 if gwno == 552 & year >= 1983 & year <= 1984 
(2 real changes made)

. replace securitycouncilmember = 1 if gwno == 552 & year >= 1991 & year <= 1992 
(2 real changes made)

. 
. 
. 
. 
. /*lag PKO varaibles */
. sum PKOtrad PKOtrans lPKObudget lPKObudgsq PKOneighbor

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     PKOtrad |     21,847    .0119009    .1084429          0          1
    PKOtrans |     21,847    .0053097    .0726753          0          1
  lPKObudget |     21,847    .0640395    .5645838          0   7.880861
  lPKObudgsq |     21,847    .3228413    3.198225          0   62.10797
 PKOneighbor |     21,847    .0222456    .1474847          0          1

. sort gwno year

. gen lPKOtrad = PKOtrad[_n-1] if gwno == gwno[_n-1]
(162 missing values generated)

. gen lPKOtrans = PKOtrans[_n-1] if gwno == gwno[_n-1]
(162 missing values generated)

. gen llPKObudget = lPKObudget[_n-1] if gwno == gwno[_n-1]
(162 missing values generated)

. gen llPKObudgsq = lPKObudgsq[_n-1] if gwno == gwno[_n-1]
(162 missing values generated)

. gen lPKOneighbor = PKOneighbor[_n-1] if gwno == gwno[_n-1]
(162 missing values generated)

. 
. gen dummyconflict = conflict >= 1

. tab conflict dummyconflict

 Incidence |
        of |
  conflict |
from UCDP, |
  extended |
  with COW |
    before |     dummyconflict
      1946 |         0          1 |     Total
-----------+----------------------+----------
         0 |    20,566          0 |    20,566 
         1 |         0        886 |       886 
         2 |         0        395 |       395 
-----------+----------------------+----------
     Total |    20,566      1,281 |    21,847 


. 
. /*PKO gdp interactions */
. gen lGDPcapPKOtrans = lGDPcap * lPKOtrans
(162 missing values generated)

. gen lGDPcapPKOtrad = lGDPcap * lPKOtrad
(162 missing values generated)

. gen lGDPcapllPKObudget = lGDPcap * llPKObudget
(162 missing values generated)

. gen lGDPcapllPKObudgsq = lGDPcap * llPKObudgsq
(162 missing values generated)

. 
. save "PredictionPKO1.dta", replace
file PredictionPKO1.dta saved

. *restore
. 
. 
. 
. 
. ****************************************************************
. ********************* RUN IV models ****************************
. ****************************************************************
. 
. /* The following line may be omitted  */
. 
. *quietly include "Scripts/InstrumentAnalysis.do"
. 
. ****************************************************************
. ********************* Simulation Models ************************
. ****************************************************************
. 
. 
. simulateit_v3e, simset(`simsetname') workdir(`work_directory') inputdatastub(`inputdata')
>  mmatrix(`MMatrixname') ///
>         depvar(`depvar')  depvarvalues(`depvarvalues') modellist(`models') simtype(`simty
> pe') ///
>         numpars(`scenarios' `redraws' `simnos' `betadraws') seedno(`seedno') ///
>         years(`est_fyear' `est_lyear' `sim_lyear' `sim_fyear' `endolastyear') parafilenam
> e(`parafile') resultsfile(`resultsfilestub') logfile(`logfile') ///
>         simresdir(`results_directory') zeroline(`zeroline') endoeq(`endogenous_eq') endop
> osition(`endoposition') endodraws(`endodraws') project("PKO")
workdir /Users/Havard/Dropbox/Collaborations/PKO/Paper/Replication package
simset name PKOsim

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    conflict |     21,847    .0767153    .3271018          0          2
Dependent variable conflict stated to have 3 values. Minimum value: 0. Maximum: 2.
re _terms: 2
maxparas: 79
parafilelength: 113
Running models 1,  models in total.
***********************************************************
************* Simulating model 1, scenario 1. *************
***********************************************************
Simsetname: PKOsim
Original parameter file: parameters_baseline
Parameter file to be used now: parameters_baseline_1_1.txt
Parameter outfile: /Users/Havard/Dropbox/Collaborations/PKO/Paper/Replication package/Param
> eters/parameters_PKOsim_1_1.txt
Input dataset: PredictionPKO1.dta
Running endogenousgrowth_v2...
       panel variable:  gwno (unbalanced)
        time variable:  year, 1960 to 2100
                delta:  1 unit
Number of countries: 162
Equation: loggdpgrowth lGDPcap ltimeindep c1 c2 ltsc0 nc ncc1 ncc2 lpop lPKOtrad lPKOtrans 
> llPKObudget llPKObudgsq lPKOneighbor lGDPcapPKOtrans lGDPcapPKOtrad _Igwno*, 17 independe
> nt variables including constant term
Year: 2013

      Source |       SS           df       MS      Number of obs   =     7,591
-------------+----------------------------------   F(178, 7413)    =      7.55
       Model |  5.84920743       178  .032860716   Prob > F        =    0.0000
    Residual |  32.2681453     7,413  .004352913   R-squared       =    0.1535
-------------+----------------------------------   Adj R-squared   =    0.1331
       Total |  38.1173527     7,591  .005021388   Root MSE        =    .06598

---------------------------------------------------------------------------------
   loggdpgrowth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
        lGDPcap |  -.0211053   .0021939    -9.62   0.000    -.0254059   -.0168047
     ltimeindep |   .0153315   .0020538     7.46   0.000     .0113055    .0193576
             c1 |  -.0112035   .0053469    -2.10   0.036    -.0216849   -.0007222
             c2 |  -.0231148   .0078898    -2.93   0.003    -.0385809   -.0076486
          ltsc0 |   .0011615   .0011269     1.03   0.303    -.0010476    .0033705
             nc |  -.0083549   .0024621    -3.39   0.001    -.0131812   -.0035285
           ncc1 |  -.0001006   .0055617    -0.02   0.986    -.0110031    .0108019
           ncc2 |   .0051744   .0086248     0.60   0.549    -.0117326    .0220814
           lpop |  -.0158906    .003674    -4.33   0.000    -.0230926   -.0086886
       lPKOtrad |   .1011451   .0438454     2.31   0.021     .0151957    .1870946
      lPKOtrans |   .0964211   .0613082     1.57   0.116    -.0237603    .2166025
    llPKObudget |  -.0073378   .0052558    -1.40   0.163    -.0176407    .0029651
    llPKObudgsq |    .000784   .0007971     0.98   0.325    -.0007785    .0023464
   lPKOneighbor |   .0201288   .0039591     5.08   0.000     .0123678    .0278899
lGDPcapPKOtrans |  -.0082956   .0083943    -0.99   0.323    -.0247509    .0081596
 lGDPcapPKOtrad |  -.0112021   .0056604    -1.98   0.048    -.0222981   -.0001061
       _Igwno_2 |   .3480853    .040124     8.68   0.000     .2694309    .4267397
      _Igwno_20 |   .3157445   .0340747     9.27   0.000     .2489485    .3825406
      _Igwno_40 |   .2754436   .0303934     9.06   0.000     .2158639    .3350233
      _Igwno_41 |   .2115119   .0287919     7.35   0.000     .1550716    .2679523
      _Igwno_42 |   .2605061   .0283446     9.19   0.000     .2049426    .3160697
      _Igwno_51 |   .2659453   .0281339     9.45   0.000     .2107948    .3210957
      _Igwno_52 |   .2852898   .0270959    10.53   0.000     .2321741    .3384054
      _Igwno_70 |   .3139522   .0361011     8.70   0.000     .2431837    .3847207
      _Igwno_90 |   .2593128   .0289765     8.95   0.000     .2025107     .316115
      _Igwno_91 |   .2352403   .0271112     8.68   0.000     .1820947    .2883859
      _Igwno_92 |   .2543214   .0277307     9.17   0.000     .1999614    .3086813
      _Igwno_93 |   .2287031   .0269056     8.50   0.000     .1759604    .2814457
      _Igwno_94 |   .2553989   .0265904     9.60   0.000     .2032741    .3075236
      _Igwno_95 |   .2740251   .0267277    10.25   0.000     .2216312    .3264191
     _Igwno_100 |   .3049924   .0331234     9.21   0.000     .2400611    .3699236
     _Igwno_101 |   .2814135   .0318518     8.84   0.000     .2189749    .3438521
     _Igwno_110 |   .2344627   .0244812     9.58   0.000     .1864726    .2824528
     _Igwno_115 |   .2408961   .0248724     9.69   0.000     .1921392     .289653
     _Igwno_130 |   .2675208    .029748     8.99   0.000     .2092064    .3258353
     _Igwno_135 |   .2897575   .0316392     9.16   0.000     .2277358    .3517793
     _Igwno_140 |      .3226   .0377634     8.54   0.000      .248573    .3966269
     _Igwno_145 |   .2431349   .0281985     8.62   0.000     .1878579    .2984119
     _Igwno_150 |   .2442106   .0267486     9.13   0.000     .1917757    .2966455
     _Igwno_155 |   .2846599   .0305588     9.32   0.000     .2247558    .3445639
     _Igwno_160 |    .293493    .033308     8.81   0.000     .2281998    .3587862
     _Igwno_165 |   .2532617   .0269566     9.40   0.000      .200419    .3061043
     _Igwno_200 |   .3196032   .0352822     9.06   0.000       .25044    .3887663
     _Igwno_205 |   .3028502   .0289679    10.45   0.000     .2460649    .3596355
     _Igwno_210 |   .2940001   .0315761     9.31   0.000      .232102    .3558982
     _Igwno_211 |   .2970816   .0311063     9.55   0.000     .2361044    .3580589
     _Igwno_212 |   .2631467   .0249472    10.55   0.000     .2142432    .3120502
     _Igwno_220 |   .3172695   .0350563     9.05   0.000     .2485491    .3859899
     _Igwno_225 |   .2783518   .0298805     9.32   0.000     .2197776     .336926
     _Igwno_230 |   .3133553   .0338647     9.25   0.000     .2469708    .3797398
     _Igwno_235 |   .2846226   .0300045     9.49   0.000     .2258053    .3434399
     _Igwno_260 |   .3502333    .038123     9.19   0.000     .2755014    .4249652
     _Igwno_290 |   .3192345    .034841     9.16   0.000     .2509362    .3875327
     _Igwno_305 |   .3087078   .0312082     9.89   0.000     .2475309    .3698846
     _Igwno_310 |    .306057   .0313087     9.78   0.000     .2446831    .3674309
     _Igwno_316 |   .3486331   .0359712     9.69   0.000     .2781193    .4191469
     _Igwno_317 |   .3450547   .0340633    10.13   0.000      .278281    .4118284
     _Igwno_325 |   .3128653   .0352739     8.87   0.000     .2437185    .3820121
     _Igwno_339 |   .2530168   .0268775     9.41   0.000     .2003292    .3057043
     _Igwno_343 |    .287092   .0304714     9.42   0.000     .2273594    .3468246
     _Igwno_344 |   .3141532     .03297     9.53   0.000     .2495226    .3787838
     _Igwno_346 |   .3622815   .0322859    11.22   0.000     .2989919    .4255711
     _Igwno_349 |   .3218672    .031669    10.16   0.000     .2597871    .3839474
     _Igwno_350 |   .2987276   .0306685     9.74   0.000     .2386086    .3588465
     _Igwno_352 |   .3034676   .0279164    10.87   0.000     .2487437    .3581916
     _Igwno_355 |   .2820505   .0299647     9.41   0.000     .2233113    .3407898
     _Igwno_359 |   .2521292   .0314722     8.01   0.000     .1904347    .3138237
     _Igwno_360 |      .2934   .0326641     8.98   0.000     .2293692    .3574308
     _Igwno_365 |   .3258589   .0384874     8.47   0.000     .2504126    .4013053
     _Igwno_366 |   .3192752   .0302398    10.56   0.000     .2599967    .3785537
     _Igwno_367 |   .3112135   .0312647     9.95   0.000     .2499258    .3725013
     _Igwno_368 |    .315165   .0323519     9.74   0.000     .2517461    .3785838
     _Igwno_369 |   .3196206   .0392185     8.15   0.000     .2427412    .3965001
     _Igwno_370 |   .3409492   .0348063     9.80   0.000     .2727189    .4091795
     _Igwno_371 |   .3021516   .0310929     9.72   0.000     .2412007    .3631025
     _Igwno_372 |    .289672   .0323804     8.95   0.000     .2261972    .3531467
     _Igwno_373 |   .3267731   .0338629     9.65   0.000     .2603921    .3931541
     _Igwno_375 |   .3022077   .0298896    10.11   0.000     .2436156    .3607999
     _Igwno_380 |     .28221   .0302055     9.34   0.000     .2229987    .3414214
     _Igwno_385 |   .2925936   .0291312    10.04   0.000     .2354882     .349699
     _Igwno_390 |   .2733385   .0289977     9.43   0.000     .2164948    .3301822
     _Igwno_402 |   .2546998   .0233185    10.92   0.000     .2089888    .3004107
     _Igwno_404 |   .2222891   .0254753     8.73   0.000     .1723501     .272228
     _Igwno_411 |   .2870671   .0237623    12.08   0.000     .2404862     .333648
     _Igwno_420 |    .222988   .0244976     9.10   0.000     .1749657    .2710103
     _Igwno_432 |    .247264   .0300542     8.23   0.000     .1883492    .3061789
     _Igwno_433 |   .2519661   .0300291     8.39   0.000     .1931005    .3108317
     _Igwno_434 |   .2445862   .0288412     8.48   0.000     .1880493    .3011232
     _Igwno_435 |   .2496093   .0264142     9.45   0.000     .1978299    .3013886
     _Igwno_436 |   .2323543   .0299023     7.77   0.000     .1737374    .2909712
     _Igwno_437 |   .2573269     .03121     8.25   0.000     .1961465    .3185074
     _Igwno_438 |   .2394098   .0290072     8.25   0.000     .1825474    .2962721
     _Igwno_439 |   .2525215   .0302465     8.35   0.000     .1932298    .3118132
     _Igwno_450 |   .1551779   .0242966     6.39   0.000     .1075496    .2028061
     _Igwno_451 |   .2305392   .0278639     8.27   0.000      .175918    .2851604
     _Igwno_452 |   .2532944   .0316117     8.01   0.000     .1913265    .3152622
     _Igwno_461 |   .2348899   .0276231     8.50   0.000     .1807408     .289039
     _Igwno_471 |   .2665414   .0313616     8.50   0.000     .2050637    .3280191
     _Igwno_475 |   .3085791   .0380419     8.11   0.000     .2340061    .3831521
     _Igwno_481 |   .2775538    .026395    10.52   0.000     .2258121    .3292954
     _Igwno_482 |   .2123336   .0268361     7.91   0.000     .1597271    .2649401
     _Igwno_483 |   .2461659   .0289417     8.51   0.000     .1894318    .3028999
     _Igwno_484 |   .2599413   .0269582     9.64   0.000     .2070956     .312787
     _Igwno_490 |   .2287179   .0344212     6.64   0.000     .1612426    .2961932
     _Igwno_500 |   .2680318    .032246     8.31   0.000     .2048205    .3312432
     _Igwno_501 |   .2790977   .0334783     8.34   0.000     .2134708    .3447247
     _Igwno_510 |   .2664865   .0335154     7.95   0.000     .2007869    .3321862
     _Igwno_516 |   .2285399   .0285113     8.02   0.000     .1726497      .28443
     _Igwno_517 |   .2442074   .0291526     8.38   0.000       .18706    .3013549
     _Igwno_520 |   .2451298   .0291665     8.40   0.000     .1879551    .3023045
     _Igwno_522 |   .2233838   .0248207     9.00   0.000     .1747282    .2720395
     _Igwno_530 |    .262825   .0333243     7.89   0.000     .1974999      .32815
     _Igwno_531 |    .238502   .0312428     7.63   0.000     .1772573    .2997468
     _Igwno_540 |   .2983278     .03298     9.05   0.000     .2336776     .362978
     _Igwno_541 |   .2684553    .033136     8.10   0.000     .2034993    .3334113
     _Igwno_551 |   .2434482   .0303362     8.03   0.000     .1839806    .3029158
     _Igwno_552 |   .2249223   .0310142     7.25   0.000     .1641255     .285719
     _Igwno_553 |   .2477965   .0304212     8.15   0.000     .1881624    .3074306
     _Igwno_560 |   .3069617   .0341739     8.98   0.000     .2399713    .3739522
     _Igwno_565 |   .2872457   .0299825     9.58   0.000     .2284714      .34602
     _Igwno_570 |   .2449047    .025683     9.54   0.000     .1945588    .2952505
     _Igwno_571 |   .3107932   .0265786    11.69   0.000     .2586915    .3628949
     _Igwno_572 |   .2483924   .0251414     9.88   0.000      .199108    .2976767
     _Igwno_580 |   .2350104   .0313067     7.51   0.000     .1736404    .2963804
     _Igwno_581 |   .1927976   .0233866     8.24   0.000     .1469533    .2386419
     _Igwno_590 |   .2840973    .026436    10.75   0.000     .2322753    .3359193
     _Igwno_600 |   .3050521   .0336416     9.07   0.000     .2391049    .3709993
     _Igwno_615 |   .3274589   .0345897     9.47   0.000     .2596533    .3952645
     _Igwno_616 |   .2983024   .0305322     9.77   0.000     .2384506    .3581542
     _Igwno_620 |   .3009365   .0298339    10.09   0.000     .2424536    .3594194
     _Igwno_625 |    .279673   .0330713     8.46   0.000     .2148438    .3445022
     _Igwno_630 |   .3066732   .0337393     9.09   0.000     .2405346    .3728119
     _Igwno_640 |   .3103109   .0339727     9.13   0.000     .2437148     .376907
     _Igwno_645 |   .2847884   .0324476     8.78   0.000      .221182    .3483949
     _Igwno_651 |    .309583   .0352502     8.78   0.000     .2404826    .3786835
     _Igwno_652 |   .2953219   .0312917     9.44   0.000     .2339813    .3566626
     _Igwno_660 |   .2958846    .028385    10.42   0.000      .240242    .3515273
     _Igwno_663 |   .2643192   .0276055     9.57   0.000     .2102047    .3184338
     _Igwno_666 |    .316456   .0307451    10.29   0.000     .2561869     .376725
     _Igwno_670 |   .3223171   .0325626     9.90   0.000     .2584852     .386149
     _Igwno_678 |   .2637828   .0304948     8.65   0.000     .2040044    .3235612
     _Igwno_690 |   .3032335   .0286959    10.57   0.000     .2469815    .3594856
     _Igwno_692 |   .2685469    .026577    10.10   0.000     .2164484    .3206453
     _Igwno_694 |   .2788757   .0273733    10.19   0.000     .2252163    .3325352
     _Igwno_696 |    .297154   .0307453     9.67   0.000     .2368844    .3574235
     _Igwno_698 |    .274915   .0251632    10.93   0.000      .225588     .324242
     _Igwno_700 |   .2508119   .0309006     8.12   0.000     .1902379    .3113859
     _Igwno_701 |   .3063595   .0324588     9.44   0.000      .242731     .369988
     _Igwno_702 |    .255825   .0326969     7.82   0.000     .1917298    .3199203
     _Igwno_703 |   .2582715   .0318706     8.10   0.000     .1957961    .3207468
     _Igwno_704 |   .3171432   .0366051     8.66   0.000     .2453869    .3888995
     _Igwno_705 |   .3446913   .0360496     9.56   0.000     .2740239    .4153588
     _Igwno_710 |   .3497935   .0432351     8.09   0.000     .2650404    .4345465
     _Igwno_712 |   .2438107   .0255136     9.56   0.000     .1937967    .2938247
     _Igwno_713 |   .3473054   .0335642    10.35   0.000     .2815101    .4131008
     _Igwno_731 |   .2601888   .0326945     7.96   0.000     .1960983    .3242793
     _Igwno_732 |   .3521346   .0357358     9.85   0.000     .2820821     .422187
     _Igwno_740 |   .3405937    .037852     9.00   0.000      .266393    .4147944
     _Igwno_750 |   .3610494   .0445846     8.10   0.000      .273651    .4484479
     _Igwno_760 |   .2459997   .0230185    10.69   0.000     .2008768    .2911225
     _Igwno_770 |   .3175137   .0376826     8.43   0.000     .2436452    .3913822
     _Igwno_771 |   .3231586   .0391236     8.26   0.000     .2464652     .399852
     _Igwno_775 |   .3013134   .0344592     8.74   0.000     .2337636    .3688633
     _Igwno_780 |   .3039064   .0320369     9.49   0.000      .241105    .3667078
     _Igwno_790 |   .2347909   .0299868     7.83   0.000     .1760082    .2935736
     _Igwno_800 |   .3088141   .0335217     9.21   0.000     .2431019    .3745262
     _Igwno_811 |   .2721687   .0302356     9.00   0.000     .2128983    .3314391
     _Igwno_812 |   .2636526   .0277754     9.49   0.000     .2092048    .3181003
     _Igwno_816 |    .303243   .0365799     8.29   0.000      .231536      .37495
     _Igwno_820 |   .3355754   .0332176    10.10   0.000     .2704594    .4006913
     _Igwno_830 |    .348851   .0301706    11.56   0.000     .2897081    .4079939
     _Igwno_840 |   .3102571   .0364111     8.52   0.000     .2388811    .3816332
     _Igwno_850 |   .3340701   .0393268     8.49   0.000     .2569784    .4111619
     _Igwno_900 |   .3121284   .0329693     9.47   0.000     .2474991    .3767576
     _Igwno_910 |   .2660393   .0299763     8.87   0.000     .2072771    .3248014
     _Igwno_920 |   .2786329   .0288128     9.67   0.000     .2221515    .3351142
     _Igwno_940 |   .2154173   .0251227     8.57   0.000     .1661696     .264665
     _Igwno_950 |   .2436823   .0251517     9.69   0.000     .1943778    .2929867
---------------------------------------------------------------------------------

Simulating main parameters.  Please wait....
% of simulations completed: 0% 1% 1% 2% 2% 3% 3% 4% 5% 5% 6% 6% 7% 7% 8% 8% 9% 10% 10% 11% 
> 11% 12% 12% 13% 14% 14% 15% 15% 16% 16% 17% 17% 18% 19% 19% 20% 20% 21% 21% 22% 23% 23% 2
> 4% 24% 25% 25% 26% 26% 27% 28% 28% 29% 29% 30% 30% 31% 32% 32% 33% 33% 34% 34% 35% 35% 36
> % 37% 37% 38% 38% 39% 39% 40% 41% 41% 42% 42% 43% 43% 44% 44% 45% 46% 46% 47% 47% 48% 48%
>  49% 50% 50% 51% 51% 52% 52% 53% 53% 54% 55% 55% 56% 56% 57% 57% 58% 58% 59% 60% 60% 61% 
> 61% 62% 62% 63% 64% 64% 65% 65% 66% 66% 67% 67% 68% 69% 69% 70% 70% 71% 71% 72% 73% 73% 7
> 4% 74% 75% 75% 76% 76% 77% 78% 78% 79% 79% 80% 80% 81% 82% 82% 83% 83% 84% 84% 85% 85% 86
> % 87% 87% 88% 88% 89% 89% 90% 91% 91% 92% 92% 93% 93% 94% 94% 95% 96% 96% 97% 97% 98% 98%
>  99% 100% 


Simulating sigma-squared.  Please wait


Number of simulations  : 50
Names of new variables : cl_1 cl_2 cl_3 cl_4 cl_5 cl_6 cl_7 cl_8 cl_9 cl_10 cl_11 cl_12 cl_
> 13 cl_14 cl_15 cl_16 cl_17 cl_18 cl_19 cl_20 cl_21 cl_22 cl_23 cl_24 cl_25 cl_26 cl_27 cl
> _28 cl_29 cl_30 cl_31 cl_32 cl_33 cl_34 cl_35 cl_36 cl_37 cl_38 cl_39 cl_40 cl_41 cl_42 c
> l_43 cl_44 cl_45 cl_46 cl_47 cl_48 cl_49 cl_50 cl_51 cl_52 cl_53 cl_54 cl_55 cl_56 cl_57 
> cl_58 cl_59 cl_60 cl_61 cl_62 cl_63 cl_64 cl_65 cl_66 cl_67 cl_68 cl_69 cl_70 cl_71 cl_72
>  cl_73 cl_74 cl_75 cl_76 cl_77 cl_78 cl_79 cl_80 cl_81 cl_82 cl_83 cl_84 cl_85 cl_86 cl_8
> 7 cl_88 cl_89 cl_90 cl_91 cl_92 cl_93 cl_94 cl_95 cl_96 cl_97 cl_98 cl_99 cl_100 cl_101 c
> l_102 cl_103 cl_104 cl_105 cl_106 cl_107 cl_108 cl_109 cl_110 cl_111 cl_112 cl_113 cl_114
>  cl_115 cl_116 cl_117 cl_118 cl_119 cl_120 cl_121 cl_122 cl_123 cl_124 cl_125 cl_126 cl_1
> 27 cl_128 cl_129 cl_130 cl_131 cl_132 cl_133 cl_134 cl_135 cl_136 cl_137 cl_138 cl_139 cl
> _140 cl_141 cl_142 cl_143 cl_144 cl_145 cl_146 cl_147 cl_148 cl_149 cl_150 cl_151 cl_152 
> cl_153 cl_154 cl_155 cl_156 cl_157 cl_158 cl_159 cl_160 cl_161 cl_162 cl_163 cl_164 cl_16
> 5 cl_166 cl_167 cl_168 cl_169 cl_170 cl_171 cl_172 cl_173 cl_174 cl_175 cl_176 cl_177 cl_
> 178 cl_179
file InputData/tempcoefs_PKOsim.dta saved
number of observations will be reset to 162
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 162
file InputData/fixedeffects_PKOsim_1.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,931
        from master                     1,931  
        from using                          0  

    matched                            21,847  
    -----------------------------------------
(output written to /Users/Havard/Dropbox/Collaborations/PKO/Paper/Replication package/Resul
> ts/FEmodel_PKOsim_1.tex)
file PredictionPKO1.dta saved
endogenousgrowth done 
Running drawrandom_v2...
(61 observations deleted)
c1 c2 ltsc0 nc ncc1 ncc2 ltsnc ncts0 lpop lGDPcap lGDPcap_c1 lGDPcap_c2 lGDPcap_ltsc0 ltime
> indep lPKOtrad lPKOtrans llPKObudget lPKOneighbor

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    conflict |     21,847    .0767153    .3271018          0          2

        inc |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,212       13.51       13.51
          1 |     20,566       86.49      100.00
------------+-----------------------------------
      Total |     23,778      100.00
Estimating random effect for outcome 0

Fitting fixed-effects model:

Iteration 0:   log likelihood = -1584.4682  
Iteration 1:   log likelihood = -1323.0686  
Iteration 2:   log likelihood = -1313.6669  
Iteration 3:   log likelihood = -1313.2258  
Iteration 4:   log likelihood = -1313.2245  
Iteration 5:   log likelihood = -1313.2245  

Refining starting values:

Grid node 0:   log likelihood =          .
Grid node 1:   log likelihood = -3820.9622
Grid node 2:   log likelihood = -2524.3693
Grid node 3:   log likelihood = -2125.7402

Fitting full model:

Iteration 0:   log likelihood = -2125.7402  
Iteration 1:   log likelihood = -1755.7203  
Iteration 2:   log likelihood = -1438.2742  
Iteration 3:   log likelihood = -1287.9283  
Iteration 4:   log likelihood = -1283.9571  
Iteration 5:   log likelihood = -1283.9308  
Iteration 6:   log likelihood = -1283.9308  

Mixed-effects logistic regression               Number of obs     =      7,591
Group variable:            gwno                 Number of groups  =        162

                                                Obs per group:
                                                              min =         20
                                                              avg =       46.9
                                                              max =         53

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(18)     =    1150.15
Log likelihood = -1283.9308                     Prob > chi2       =     0.0000
-------------------------------------------------------------------------------
          inc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
           c1 |  -2.023686   1.287458    -1.57   0.116    -4.547057    .4996847
           c2 |  -5.433853   2.091684    -2.60   0.009    -9.533478   -1.334228
        ltsc0 |  -.2515682   .4214816    -0.60   0.551    -1.077657    .5745205
           nc |  -.7887633    .327873    -2.41   0.016    -1.431383   -.1461441
         ncc1 |   .6098679   .3734172     1.63   0.102    -.1220163    1.341752
         ncc2 |  -.2986861   .5507385    -0.54   0.588    -1.378114    .7807415
        ltsnc |  -.0370956    .060638    -0.61   0.541    -.1559438    .0817527
        ncts0 |  -.0360331   .1317067    -0.27   0.784    -.2941736    .2221074
         lpop |  -.3057595   .0703645    -4.35   0.000    -.4436714   -.1678476
      lGDPcap |   .1853679   .1479405     1.25   0.210    -.1045901     .475326
   lGDPcap_c1 |  -.1534152   .1569307    -0.98   0.328    -.4609937    .1541633
   lGDPcap_c2 |    .208978    .259529     0.81   0.421    -.2996895    .7176456
lGDPcap_ltsc0 |   .0890849   .0535319     1.66   0.096    -.0158356    .1940054
   ltimeindep |  -.1243427   .0798265    -1.56   0.119    -.2807997    .0321142
     lPKOtrad |   .1390491   .4568257     0.30   0.761    -.7563129    1.034411
    lPKOtrans |   .2028579   .7052797     0.29   0.774    -1.179465    1.585181
  llPKObudget |  -.0143567    .113506    -0.13   0.899    -.2368243    .2081109
 lPKOneighbor |   .1402707   .2143464     0.65   0.513    -.2798405     .560382
        _cons |   4.627168   1.325783     3.49   0.000     2.028682    7.225654
--------------+----------------------------------------------------------------
gwno          |
    var(_cons)|   .6870419   .1843186                      .4060918    1.162364
-------------------------------------------------------------------------------
LR test vs. logistic model: chibar2(01) = 58.59       Prob >= chibar2 = 0.0000
file randomeffectsmodel.ster saved
(output written to Results/PKOsim/re_model_1_0_o.tex)
(calculating posterior means of random effects)
(using 7 quadrature points)
(1931 missing values generated)
(23,616 observations deleted)
2 20 40 41 42 51 52 70 90 91 92 93 94 95 100 101 110 115 130 135 140 145 150 155 160 165 20
> 0 205 210 211 212 220 225 230 235 260 290 305 310 316 317 325 339 343 344 346 349 350 352
>  355 359 360 365 366 367 368 369 370 371 372 373 375 380 385 390 402 404 411 420 432 433 
> 434 435 436 437 438 439 450 451 452 461 471 475 481 482 483 484 490 500 501 510 516 517 5
> 20 522 530 531 540 541 551 552 553 560 565 570 571 572 580 581 590 600 615 616 620 625 63
> 0 640 645 651 652 660 663 666 670 678 690 692 694 696 698 700 701 702 703 704 705 710 712
>  713 731 732 740 750 760 770 771 775 780 790 800 811 812 816 820 830 840 850 900 910 920 
> 940 950
Random effects calculated for 162 countries
drawing country country: 1
drawing country country: 1
drawing country country: 1
drawing country country: 1
drawing country country: 1
drawing country country: 2
drawing country country: 2
drawing country country: 2
drawing country country: 2
drawing country country: 2
drawing country country: 3
drawing country country: 3
drawing country country: 3
drawing country country: 3
drawing country country: 3
drawing country country: 4
drawing country country: 4
drawing country country: 4
drawing country country: 4
drawing country country: 4
drawing country country: 5
drawing country country: 5
drawing country country: 5
drawing country country: 5
drawing country country: 5
drawing country country: 6
drawing country country: 6
drawing country country: 6
drawing country country: 6
drawing country country: 6
drawing country country: 7
drawing country country: 7
drawing country country: 7
drawing country country: 7
drawing country country: 7
drawing country country: 8
drawing country country: 8
drawing country country: 8
drawing country country: 8
drawing country country: 8
drawing country country: 9
drawing country country: 9
drawing country country: 9
drawing country country: 9
drawing country country: 9
drawing country country: 10
drawing country country: 10
drawing country country: 10
drawing country country: 10
drawing country country: 10
drawing country country: 11
drawing country country: 11
drawing country country: 11
drawing country country: 11
drawing country country: 11
drawing country country: 12
drawing country country: 12
drawing country country: 12
drawing country country: 12
drawing country country: 12
drawing country country: 13
drawing country country: 13
drawing country country: 13
drawing country country: 13
drawing country country: 13
drawing country country: 14
drawing country country: 14
drawing country country: 14
drawing country country: 14
drawing country country: 14
drawing country country: 15
drawing country country: 15
drawing country country: 15
drawing country country: 15
drawing country country: 15
drawing country country: 16
drawing country country: 16
drawing country country: 16
drawing country country: 16
drawing country country: 16
drawing country country: 17
drawing country country: 17
drawing country country: 17
drawing country country: 17
drawing country country: 17
drawing country country: 18
drawing country country: 18
drawing country country: 18
drawing country country: 18
drawing country country: 18
drawing country country: 19
drawing country country: 19
drawing country country: 19
drawing country country: 19
drawing country country: 19
drawing country country: 20
drawing country country: 20
drawing country country: 20
drawing country country: 20
drawing country country: 20
drawing country country: 21
drawing country country: 21
drawing country country: 21
drawing country country: 21
drawing country country: 21
drawing country country: 22
drawing country country: 22
drawing country country: 22
drawing country country: 22
drawing country country: 22
drawing country country: 23
drawing country country: 23
drawing country country: 23
drawing country country: 23
drawing country country: 23
drawing country country: 24
drawing country country: 24
drawing country country: 24
drawing country country: 24
drawing country country: 24
drawing country country: 25
drawing country country: 25
drawing country country: 25
drawing country country: 25
drawing country country: 25
drawing country country: 26
drawing country country: 26
drawing country country: 26
drawing country country: 26
drawing country country: 26
drawing country country: 27
drawing country country: 27
drawing country country: 27
drawing country country: 27
drawing country country: 27
drawing country country: 28
drawing country country: 28
drawing country country: 28
drawing country country: 28
drawing country country: 28
drawing country country: 29
drawing country country: 29
drawing country country: 29
drawing country country: 29
drawing country country: 29
drawing country country: 30
drawing country country: 30
drawing country country: 30
drawing country country: 30
drawing country country: 30
drawing country country: 31
drawing country country: 31
drawing country country: 31
drawing country country: 31
drawing country country: 31
drawing country country: 32
drawing country country: 32
drawing country country: 32
drawing country country: 32
drawing country country: 32
drawing country country: 33
drawing country country: 33
drawing country country: 33
drawing country country: 33
drawing country country: 33
drawing country country: 34
drawing country country: 34
drawing country country: 34
drawing country country: 34
drawing country country: 34
drawing country country: 35
drawing country country: 35
drawing country country: 35
drawing country country: 35
drawing country country: 35
drawing country country: 36
drawing country country: 36
drawing country country: 36
drawing country country: 36
drawing country country: 36
drawing country country: 37
drawing country country: 37
drawing country country: 37
drawing country country: 37
drawing country country: 37
drawing country country: 38
drawing country country: 38
drawing country country: 38
drawing country country: 38
drawing country country: 38
drawing country country: 39
drawing country country: 39
drawing country country: 39
drawing country country: 39
drawing country country: 39
drawing country country: 40
drawing country country: 40
drawing country country: 40
drawing country country: 40
drawing country country: 40
drawing country country: 41
drawing country country: 41
drawing country country: 41
drawing country country: 41
drawing country country: 41
drawing country country: 42
drawing country country: 42
drawing country country: 42
drawing country country: 42
drawing country country: 42
drawing country country: 43
drawing country country: 43
drawing country country: 43
drawing country country: 43
drawing country country: 43
drawing country country: 44
drawing country country: 44
drawing country country: 44
drawing country country: 44
drawing country country: 44
drawing country country: 45
drawing country country: 45
drawing country country: 45
drawing country country: 45
drawing country country: 45
drawing country country: 46
drawing country country: 46
drawing country country: 46
drawing country country: 46
drawing country country: 46
drawing country country: 47
drawing country country: 47
drawing country country: 47
drawing country country: 47
drawing country country: 47
drawing country country: 48
drawing country country: 48
drawing country country: 48
drawing country country: 48
drawing country country: 48
drawing country country: 49
drawing country country: 49
drawing country country: 49
drawing country country: 49
drawing country country: 49
drawing country country: 50
drawing country country: 50
drawing country country: 50
drawing country country: 50
drawing country country: 50
drawing country country: 51
drawing country country: 51
drawing country country: 51
drawing country country: 51
drawing country country: 51
drawing country country: 52
drawing country country: 52
drawing country country: 52
drawing country country: 52
drawing country country: 52
drawing country country: 53
drawing country country: 53
drawing country country: 53
drawing country country: 53
drawing country country: 53
drawing country country: 54
drawing country country: 54
drawing country country: 54
drawing country country: 54
drawing country country: 54
drawing country country: 55
drawing country country: 55
drawing country country: 55
drawing country country: 55
drawing country country: 55
drawing country country: 56
drawing country country: 56
drawing country country: 56
drawing country country: 56
drawing country country: 56
drawing country country: 57
drawing country country: 57
drawing country country: 57
drawing country country: 57
drawing country country: 57
drawing country country: 58
drawing country country: 58
drawing country country: 58
drawing country country: 58
drawing country country: 58
drawing country country: 59
drawing country country: 59
drawing country country: 59
drawing country country: 59
drawing country country: 59
drawing country country: 60
drawing country country: 60
drawing country country: 60
drawing country country: 60
drawing country country: 60
drawing country country: 61
drawing country country: 61
drawing country country: 61
drawing country country: 61
drawing country country: 61
drawing country country: 62
drawing country country: 62
drawing country country: 62
drawing country country: 62
drawing country country: 62
drawing country country: 63
drawing country country: 63
drawing country country: 63
drawing country country: 63
drawing country country: 63
drawing country country: 64
drawing country country: 64
drawing country country: 64
drawing country country: 64
drawing country country: 64
drawing country country: 65
drawing country country: 65
drawing country country: 65
drawing country country: 65
drawing country country: 65
drawing country country: 66
drawing country country: 66
drawing country country: 66
drawing country country: 66
drawing country country: 66
drawing country country: 67
drawing country country: 67
drawing country country: 67
drawing country country: 67
drawing country country: 67
drawing country country: 68
drawing country country: 68
drawing country country: 68
drawing country country: 68
drawing country country: 68
drawing country country: 69
drawing country country: 69
drawing country country: 69
drawing country country: 69
drawing country country: 69
drawing country country: 70
drawing country country: 70
drawing country country: 70
drawing country country: 70
drawing country country: 70
drawing country country: 71
drawing country country: 71
drawing country country: 71
drawing country country: 71
drawing country country: 71
drawing country country: 72
drawing country country: 72
drawing country country: 72
drawing country country: 72
drawing country country: 72
drawing country country: 73
drawing country country: 73
drawing country country: 73
drawing country country: 73
drawing country country: 73
drawing country country: 74
drawing country country: 74
drawing country country: 74
drawing country country: 74
drawing country country: 74
drawing country country: 75
drawing country country: 75
drawing country country: 75
drawing country country: 75
drawing country country: 75
drawing country country: 76
drawing country country: 76
drawing country country: 76
drawing country country: 76
drawing country country: 76
drawing country country: 77
drawing country country: 77
drawing country country: 77
drawing country country: 77
drawing country country: 77
drawing country country: 78
drawing country country: 78
drawing country country: 78
drawing country country: 78
drawing country country: 78
drawing country country: 79
drawing country country: 79
drawing country country: 79
drawing country country: 79
drawing country country: 79
drawing country country: 80
drawing country country: 80
drawing country country: 80
drawing country country: 80
drawing country country: 80
drawing country country: 81
drawing country country: 81
drawing country country: 81
drawing country country: 81
drawing country country: 81
drawing country country: 82
drawing country country: 82
drawing country country: 82
drawing country country: 82
drawing country country: 82
drawing country country: 83
drawing country country: 83
drawing country country: 83
drawing country country: 83
drawing country country: 83
drawing country country: 84
drawing country country: 84
drawing country country: 84
drawing country country: 84
drawing country country: 84
drawing country country: 85
drawing country country: 85
drawing country country: 85
drawing country country: 85
drawing country country: 85
drawing country country: 86
drawing country country: 86
drawing country country: 86
drawing country country: 86
drawing country country: 86
drawing country country: 87
drawing country country: 87
drawing country country: 87
drawing country country: 87
drawing country country: 87
drawing country country: 88
drawing country country: 88
drawing country country: 88
drawing country country: 88
drawing country country: 88
drawing country country: 89
drawing country country: 89
drawing country country: 89
drawing country country: 89
drawing country country: 89
drawing country country: 90
drawing country country: 90
drawing country country: 90
drawing country country: 90
drawing country country: 90
drawing country country: 91
drawing country country: 91
drawing country country: 91
drawing country country: 91
drawing country country: 91
drawing country country: 92
drawing country country: 92
drawing country country: 92
drawing country country: 92
drawing country country: 92
drawing country country: 93
drawing country country: 93
drawing country country: 93
drawing country country: 93
drawing country country: 93
drawing country country: 94
drawing country country: 94
drawing country country: 94
drawing country country: 94
drawing country country: 94
drawing country country: 95
drawing country country: 95
drawing country country: 95
drawing country country: 95
drawing country country: 95
drawing country country: 96
drawing country country: 96
drawing country country: 96
drawing country country: 96
drawing country country: 96
drawing country country: 97
drawing country country: 97
drawing country country: 97
drawing country country: 97
drawing country country: 97
drawing country country: 98
drawing country country: 98
drawing country country: 98
drawing country country: 98
drawing country country: 98
drawing country country: 99
drawing country country: 99
drawing country country: 99
drawing country country: 99
drawing country country: 99
drawing country country: 100
drawing country country: 100
drawing country country: 100
drawing country country: 100
drawing country country: 100
drawing country country: 101
drawing country country: 101
drawing country country: 101
drawing country country: 101
drawing country country: 101
drawing country country: 102
drawing country country: 102
drawing country country: 102
drawing country country: 102
drawing country country: 102
drawing country country: 103
drawing country country: 103
drawing country country: 103
drawing country country: 103
drawing country country: 103
drawing country country: 104
drawing country country: 104
drawing country country: 104
drawing country country: 104
drawing country country: 104
drawing country country: 105
drawing country country: 105
drawing country country: 105
drawing country country: 105
drawing country country: 105
drawing country country: 106
drawing country country: 106
drawing country country: 106
drawing country country: 106
drawing country country: 106
drawing country country: 107
drawing country country: 107
drawing country country: 107
drawing country country: 107
drawing country country: 107
drawing country country: 108
drawing country country: 108
drawing country country: 108
drawing country country: 108
drawing country country: 108
drawing country country: 109
drawing country country: 109
drawing country country: 109
drawing country country: 109
drawing country country: 109
drawing country country: 110
drawing country country: 110
drawing country country: 110
drawing country country: 110
drawing country country: 110
drawing country country: 111
drawing country country: 111
drawing country country: 111
drawing country country: 111
drawing country country: 111
drawing country country: 112
drawing country country: 112
drawing country country: 112
drawing country country: 112
drawing country country: 112
drawing country country: 113
drawing country country: 113
drawing country country: 113
drawing country country: 113
drawing country country: 113
drawing country country: 114
drawing country country: 114
drawing country country: 114
drawing country country: 114
drawing country country: 114
drawing country country: 115
drawing country country: 115
drawing country country: 115
drawing country country: 115
drawing country country: 115
drawing country country: 116
drawing country country: 116
drawing country country: 116
drawing country country: 116
drawing country country: 116
drawing country country: 117
drawing country country: 117
drawing country country: 117
drawing country country: 117
drawing country country: 117
drawing country country: 118
drawing country country: 118
drawing country country: 118
drawing country country: 118
drawing country country: 118
drawing country country: 119
drawing country country: 119
drawing country country: 119
drawing country country: 119
drawing country country: 119
drawing country country: 120
drawing country country: 120
drawing country country: 120
drawing country country: 120
drawing country country: 120
drawing country country: 121
drawing country country: 121
drawing country country: 121
drawing country country: 121
drawing country country: 121
drawing country country: 122
drawing country country: 122
drawing country country: 122
drawing country country: 122
drawing country country: 122
drawing country country: 123
drawing country country: 123
drawing country country: 123
drawing country country: 123
drawing country country: 123
drawing country country: 124
drawing country country: 124
drawing country country: 124
drawing country country: 124
drawing country country: 124
drawing country country: 125
drawing country country: 125
drawing country country: 125
drawing country country: 125
drawing country country: 125
drawing country country: 126
drawing country country: 126
drawing country country: 126
drawing country country: 126
drawing country country: 126
drawing country country: 127
drawing country country: 127
drawing country country: 127
drawing country country: 127
drawing country country: 127
drawing country country: 128
drawing country country: 128
drawing country country: 128
drawing country country: 128
drawing country country: 128
drawing country country: 129
drawing country country: 129
drawing country country: 129
drawing country country: 129
drawing country country: 129
drawing country country: 130
drawing country country: 130
drawing country country: 130
drawing country country: 130
drawing country country: 130
drawing country country: 131
drawing country country: 131
drawing country country: 131
drawing country country: 131
drawing country country: 131
drawing country country: 132
drawing country country: 132
drawing country country: 132
drawing country country: 132
drawing country country: 132
drawing country country: 133
drawing country country: 133
drawing country country: 133
drawing country country: 133
drawing country country: 133
drawing country country: 134
drawing country country: 134
drawing country country: 134
drawing country country: 134
drawing country country: 134
drawing country country: 135
drawing country country: 135
drawing country country: 135
drawing country country: 135
drawing country country: 135
drawing country country: 136
drawing country country: 136
drawing country country: 136
drawing country country: 136
drawing country country: 136
drawing country country: 137
drawing country country: 137
drawing country country: 137
drawing country country: 137
drawing country country: 137
drawing country country: 138
drawing country country: 138
drawing country country: 138
drawing country country: 138
drawing country country: 138
drawing country country: 139
drawing country country: 139
drawing country country: 139
drawing country country: 139
drawing country country: 139
drawing country country: 140
drawing country country: 140
drawing country country: 140
drawing country country: 140
drawing country country: 140
drawing country country: 141
drawing country country: 141
drawing country country: 141
drawing country country: 141
drawing country country: 141
drawing country country: 142
drawing country country: 142
drawing country country: 142
drawing country country: 142
drawing country country: 142
drawing country country: 143
drawing country country: 143
drawing country country: 143
drawing country country: 143
drawing country country: 143
drawing country country: 144
drawing country country: 144
drawing country country: 144
drawing country country: 144
drawing country country: 144
drawing country country: 145
drawing country country: 145
drawing country country: 145
drawing country country: 145
drawing country country: 145
drawing country country: 146
drawing country country: 146
drawing country country: 146
drawing country country: 146
drawing country country: 146
drawing country country: 147
drawing country country: 147
drawing country country: 147
drawing country country: 147
drawing country country: 147
drawing country country: 148
drawing country country: 148
drawing country country: 148
drawing country country: 148
drawing country country: 148
drawing country country: 149
drawing country country: 149
drawing country country: 149
drawing country country: 149
drawing country country: 149
drawing country country: 150
drawing country country: 150
drawing country country: 150
drawing country country: 150
drawing country country: 150
drawing country country: 151
drawing country country: 151
drawing country country: 151
drawing country country: 151
drawing country country: 151
drawing country country: 152
drawing country country: 152
drawing country country: 152
drawing country country: 152
drawing country country: 152
drawing country country: 153
drawing country country: 153
drawing country country: 153
drawing country country: 153
drawing country country: 153
drawing country country: 154
drawing country country: 154
drawing country country: 154
drawing country country: 154
drawing country country: 154
drawing country country: 155
drawing country country: 155
drawing country country: 155
drawing country country: 155
drawing country country: 155
drawing country country: 156
drawing country country: 156
drawing country country: 156
drawing country country: 156
drawing country country: 156
drawing country country: 157
drawing country country: 157
drawing country country: 157
drawing country country: 157
drawing country country: 157
drawing country country: 158
drawing country country: 158
drawing country country: 158
drawing country country: 158
drawing country country: 158
drawing country country: 159
drawing country country: 159
drawing country country: 159
drawing country country: 159
drawing country country: 159
drawing country country: 160
drawing country country: 160
drawing country country: 160
drawing country country: 160
drawing country country: 160
drawing country country: 161
drawing country country: 161
drawing country country: 161
drawing country country: 161
drawing country country: 161
drawing country country: 162
drawing country country: 162
drawing country country: 162
drawing country country: 162
drawing country country: 162
number of observations will be reset to 162
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 162
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in older Stata
      formats)
file Results/PKOsim/re_model_1_0_o.dta saved

        inc |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,892       96.27       96.27
          1 |        886        3.73      100.00
------------+-----------------------------------
      Total |     23,778      100.00
Estimating random effect for outcome 1

Fitting fixed-effects model:

Iteration 0:   log likelihood = -1713.0865  
Iteration 1:   log likelihood =  -1444.159  
Iteration 2:   log likelihood = -1434.0604  
Iteration 3:   log likelihood = -1433.5526  
Iteration 4:   log likelihood = -1433.5521  
Iteration 5:   log likelihood = -1433.5521  

Refining starting values:

Grid node 0:   log likelihood =          .
Grid node 1:   log likelihood =  -3773.495
Grid node 2:   log likelihood = -2430.4449
Grid node 3:   log likelihood = -2013.9396

Fitting full model:

Iteration 0:   log likelihood = -2013.9396  
Iteration 1:   log likelihood =  -1845.474  
Iteration 2:   log likelihood = -1722.7224  
Iteration 3:   log likelihood = -1502.7144  
Iteration 4:   log likelihood = -1416.0445  
Iteration 5:   log likelihood = -1414.9549  
Iteration 6:   log likelihood =  -1414.945  
Iteration 7:   log likelihood =  -1414.945  

Mixed-effects logistic regression               Number of obs     =      7,591
Group variable:            gwno                 Number of groups  =        162

                                                Obs per group:
                                                              min =         20
                                                              avg =       46.9
                                                              max =         53

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(18)     =     916.47
Log likelihood =  -1414.945                     Prob > chi2       =     0.0000
-------------------------------------------------------------------------------
          inc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
           c1 |   .7804039   1.247404     0.63   0.532    -1.664462     3.22527
           c2 |  -1.302512   1.560421    -0.83   0.404     -4.36088    1.755857
        ltsc0 |   .0439502   .4270016     0.10   0.918    -.7929575    .8808579
           nc |   .6957979   .3325201     2.09   0.036     .0440705    1.347525
         ncc1 |  -.7493084   .3686777    -2.03   0.042    -1.471903   -.0267134
         ncc2 |  -.8726792   .4490915    -1.94   0.052    -1.752882    .0075239
        ltsnc |   .0235953   .0545562     0.43   0.665    -.0833329    .1305234
        ncts0 |    .010256     .13625     0.08   0.940     -.256789     .277301
         lpop |   .2040323   .0582878     3.50   0.000     .0897904    .3182741
      lGDPcap |  -.1833337   .1416023    -1.29   0.195    -.4608691    .0942017
   lGDPcap_c1 |   .2757827   .1522343     1.81   0.070    -.0225912    .5741565
   lGDPcap_c2 |   .3012155   .1925096     1.56   0.118    -.0760964    .6785274
lGDPcap_ltsc0 |  -.0683121   .0541431    -1.26   0.207    -.1744307    .0378065
   ltimeindep |   .1889244    .071305     2.65   0.008     .0491692    .3286796
     lPKOtrad |   .2758315    .406449     0.68   0.497     -.520794    1.072457
    lPKOtrans |   .4267319   .6416478     0.67   0.506    -.8308748    1.684339
  llPKObudget |    -.04207   .1020782    -0.41   0.680    -.2421396    .1579996
 lPKOneighbor |   .1277046   .1911493     0.67   0.504    -.2469411    .5023502
        _cons |  -3.881299    1.25127    -3.10   0.002    -6.333743   -1.428854
--------------+----------------------------------------------------------------
gwno          |
    var(_cons)|   .3553049    .110096                       .193573     .652165
-------------------------------------------------------------------------------
LR test vs. logistic model: chibar2(01) = 37.21       Prob >= chibar2 = 0.0000
file randomeffectsmodel.ster saved
(output written to Results/PKOsim/re_model_1_1_o.tex)
(calculating posterior means of random effects)
(using 7 quadrature points)
(1931 missing values generated)
(23,616 observations deleted)
2 20 40 41 42 51 52 70 90 91 92 93 94 95 100 101 110 115 130 135 140 145 150 155 160 165 20
> 0 205 210 211 212 220 225 230 235 260 290 305 310 316 317 325 339 343 344 346 349 350 352
>  355 359 360 365 366 367 368 369 370 371 372 373 375 380 385 390 402 404 411 420 432 433 
> 434 435 436 437 438 439 450 451 452 461 471 475 481 482 483 484 490 500 501 510 516 517 5
> 20 522 530 531 540 541 551 552 553 560 565 570 571 572 580 581 590 600 615 616 620 625 63
> 0 640 645 651 652 660 663 666 670 678 690 692 694 696 698 700 701 702 703 704 705 710 712
>  713 731 732 740 750 760 770 771 775 780 790 800 811 812 816 820 830 840 850 900 910 920 
> 940 950
Random effects calculated for 162 countries
drawing country country: 1
drawing country country: 1
drawing country country: 1
drawing country country: 1
drawing country country: 1
drawing country country: 2
drawing country country: 2
drawing country country: 2
drawing country country: 2
drawing country country: 2
drawing country country: 3
drawing country country: 3
drawing country country: 3
drawing country country: 3
drawing country country: 3
drawing country country: 4
drawing country country: 4
drawing country country: 4
drawing country country: 4
drawing country country: 4
drawing country country: 5
drawing country country: 5
drawing country country: 5
drawing country country: 5
drawing country country: 5
drawing country country: 6
drawing country country: 6
drawing country country: 6
drawing country country: 6
drawing country country: 6
drawing country country: 7
drawing country country: 7
drawing country country: 7
drawing country country: 7
drawing country country: 7
drawing country country: 8
drawing country country: 8
drawing country country: 8
drawing country country: 8
drawing country country: 8
drawing country country: 9
drawing country country: 9
drawing country country: 9
drawing country country: 9
drawing country country: 9
drawing country country: 10
drawing country country: 10
drawing country country: 10
drawing country country: 10
drawing country country: 10
drawing country country: 11
drawing country country: 11
drawing country country: 11
drawing country country: 11
drawing country country: 11
drawing country country: 12
drawing country country: 12
drawing country country: 12
drawing country country: 12
drawing country country: 12
drawing country country: 13
drawing country country: 13
drawing country country: 13
drawing country country: 13
drawing country country: 13
drawing country country: 14
drawing country country: 14
drawing country country: 14
drawing country country: 14
drawing country country: 14
drawing country country: 15
drawing country country: 15
drawing country country: 15
drawing country country: 15
drawing country country: 15
drawing country country: 16
drawing country country: 16
drawing country country: 16
drawing country country: 16
drawing country country: 16
drawing country country: 17
drawing country country: 17
drawing country country: 17
drawing country country: 17
drawing country country: 17
drawing country country: 18
drawing country country: 18
drawing country country: 18
drawing country country: 18
drawing country country: 18
drawing country country: 19
drawing country country: 19
drawing country country: 19
drawing country country: 19
drawing country country: 19
drawing country country: 20
drawing country country: 20
drawing country country: 20
drawing country country: 20
drawing country country: 20
drawing country country: 21
drawing country country: 21
drawing country country: 21
drawing country country: 21
drawing country country: 21
drawing country country: 22
drawing country country: 22
drawing country country: 22
drawing country country: 22
drawing country country: 22
drawing country country: 23
drawing country country: 23
drawing country country: 23
drawing country country: 23
drawing country country: 23
drawing country country: 24
drawing country country: 24
drawing country country: 24
drawing country country: 24
drawing country country: 24
drawing country country: 25
drawing country country: 25
drawing country country: 25
drawing country country: 25
drawing country country: 25
drawing country country: 26
drawing country country: 26
drawing country country: 26
drawing country country: 26
drawing country country: 26
drawing country country: 27
drawing country country: 27
drawing country country: 27
drawing country country: 27
drawing country country: 27
drawing country country: 28
drawing country country: 28
drawing country country: 28
drawing country country: 28
drawing country country: 28
drawing country country: 29
drawing country country: 29
drawing country country: 29
drawing country country: 29
drawing country country: 29
drawing country country: 30
drawing country country: 30
drawing country country: 30
drawing country country: 30
drawing country country: 30
drawing country country: 31
drawing country country: 31
drawing country country: 31
drawing country country: 31
drawing country country: 31
drawing country country: 32
drawing country country: 32
drawing country country: 32
drawing country country: 32
drawing country country: 32
drawing country country: 33
drawing country country: 33
drawing country country: 33
drawing country country: 33
drawing country country: 33
drawing country country: 34
drawing country country: 34
drawing country country: 34
drawing country country: 34
drawing country country: 34
drawing country country: 35
drawing country country: 35
drawing country country: 35
drawing country country: 35
drawing country country: 35
drawing country country: 36
drawing country country: 36
drawing country country: 36
drawing country country: 36
drawing country country: 36
drawing country country: 37
drawing country country: 37
drawing country country: 37
drawing country country: 37
drawing country country: 37
drawing country country: 38
drawing country country: 38
drawing country country: 38
drawing country country: 38
drawing country country: 38
drawing country country: 39
drawing country country: 39
drawing country country: 39
drawing country country: 39
drawing country country: 39
drawing country country: 40
drawing country country: 40
drawing country country: 40
drawing country country: 40
drawing country country: 40
drawing country country: 41
drawing country country: 41
drawing country country: 41
drawing country country: 41
drawing country country: 41
drawing country country: 42
drawing country country: 42
drawing country country: 42
drawing country country: 42
drawing country country: 42
drawing country country: 43
drawing country country: 43
drawing country country: 43
drawing country country: 43
drawing country country: 43
drawing country country: 44
drawing country country: 44
drawing country country: 44
drawing country country: 44
drawing country country: 44
drawing country country: 45
drawing country country: 45
drawing country country: 45
drawing country country: 45
drawing country country: 45
drawing country country: 46
drawing country country: 46
drawing country country: 46
drawing country country: 46
drawing country country: 46
drawing country country: 47
drawing country country: 47
drawing country country: 47
drawing country country: 47
drawing country country: 47
drawing country country: 48
drawing country country: 48
drawing country country: 48
drawing country country: 48
drawing country country: 48
drawing country country: 49
drawing country country: 49
drawing country country: 49
drawing country country: 49
drawing country country: 49
drawing country country: 50
drawing country country: 50
drawing country country: 50
drawing country country: 50
drawing country country: 50
drawing country country: 51
drawing country country: 51
drawing country country: 51
drawing country country: 51
drawing country country: 51
drawing country country: 52
drawing country country: 52
drawing country country: 52
drawing country country: 52
drawing country country: 52
drawing country country: 53
drawing country country: 53
drawing country country: 53
drawing country country: 53
drawing country country: 53
drawing country country: 54
drawing country country: 54
drawing country country: 54
drawing country country: 54
drawing country country: 54
drawing country country: 55
drawing country country: 55
drawing country country: 55
drawing country country: 55
drawing country country: 55
drawing country country: 56
drawing country country: 56
drawing country country: 56
drawing country country: 56
drawing country country: 56
drawing country country: 57
drawing country country: 57
drawing country country: 57
drawing country country: 57
drawing country country: 57
drawing country country: 58
drawing country country: 58
drawing country country: 58
drawing country country: 58
drawing country country: 58
drawing country country: 59
drawing country country: 59
drawing country country: 59
drawing country country: 59
drawing country country: 59
drawing country country: 60
drawing country country: 60
drawing country country: 60
drawing country country: 60
drawing country country: 60
drawing country country: 61
drawing country country: 61
drawing country country: 61
drawing country country: 61
drawing country country: 61
drawing country country: 62
drawing country country: 62
drawing country country: 62
drawing country country: 62
drawing country country: 62
drawing country country: 63
drawing country country: 63
drawing country country: 63
drawing country country: 63
drawing country country: 63
drawing country country: 64
drawing country country: 64
drawing country country: 64
drawing country country: 64
drawing country country: 64
drawing country country: 65
drawing country country: 65
drawing country country: 65
drawing country country: 65
drawing country country: 65
drawing country country: 66
drawing country country: 66
drawing country country: 66
drawing country country: 66
drawing country country: 66
drawing country country: 67
drawing country country: 67
drawing country country: 67
drawing country country: 67
drawing country country: 67
drawing country country: 68
drawing country country: 68
drawing country country: 68
drawing country country: 68
drawing country country: 68
drawing country country: 69
drawing country country: 69
drawing country country: 69
drawing country country: 69
drawing country country: 69
drawing country country: 70
drawing country country: 70
drawing country country: 70
drawing country country: 70
drawing country country: 70
drawing country country: 71
drawing country country: 71
drawing country country: 71
drawing country country: 71
drawing country country: 71
drawing country country: 72
drawing country country: 72
drawing country country: 72
drawing country country: 72
drawing country country: 72
drawing country country: 73
drawing country country: 73
drawing country country: 73
drawing country country: 73
drawing country country: 73
drawing country country: 74
drawing country country: 74
drawing country country: 74
drawing country country: 74
drawing country country: 74
drawing country country: 75
drawing country country: 75
drawing country country: 75
drawing country country: 75
drawing country country: 75
drawing country country: 76
drawing country country: 76
drawing country country: 76
drawing country country: 76
drawing country country: 76
drawing country country: 77
drawing country country: 77
drawing country country: 77
drawing country country: 77
drawing country country: 77
drawing country country: 78
drawing country country: 78
drawing country country: 78
drawing country country: 78
drawing country country: 78
drawing country country: 79
drawing country country: 79
drawing country country: 79
drawing country country: 79
drawing country country: 79
drawing country country: 80
drawing country country: 80
drawing country country: 80
drawing country country: 80
drawing country country: 80
drawing country country: 81
drawing country country: 81
drawing country country: 81
drawing country country: 81
drawing country country: 81
drawing country country: 82
drawing country country: 82
drawing country country: 82
drawing country country: 82
drawing country country: 82
drawing country country: 83
drawing country country: 83
drawing country country: 83
drawing country country: 83
drawing country country: 83
drawing country country: 84
drawing country country: 84
drawing country country: 84
drawing country country: 84
drawing country country: 84
drawing country country: 85
drawing country country: 85
drawing country country: 85
drawing country country: 85
drawing country country: 85
drawing country country: 86
drawing country country: 86
drawing country country: 86
drawing country country: 86
drawing country country: 86
drawing country country: 87
drawing country country: 87
drawing country country: 87
drawing country country: 87
drawing country country: 87
drawing country country: 88
drawing country country: 88
drawing country country: 88
drawing country country: 88
drawing country country: 88
drawing country country: 89
drawing country country: 89
drawing country country: 89
drawing country country: 89
drawing country country: 89
drawing country country: 90
drawing country country: 90
drawing country country: 90
drawing country country: 90
drawing country country: 90
drawing country country: 91
drawing country country: 91
drawing country country: 91
drawing country country: 91
drawing country country: 91
drawing country country: 92
drawing country country: 92
drawing country country: 92
drawing country country: 92
drawing country country: 92
drawing country country: 93
drawing country country: 93
drawing country country: 93
drawing country country: 93
drawing country country: 93
drawing country country: 94
drawing country country: 94
drawing country country: 94
drawing country country: 94
drawing country country: 94
drawing country country: 95
drawing country country: 95
drawing country country: 95
drawing country country: 95
drawing country country: 95
drawing country country: 96
drawing country country: 96
drawing country country: 96
drawing country country: 96
drawing country country: 96
drawing country country: 97
drawing country country: 97
drawing country country: 97
drawing country country: 97
drawing country country: 97
drawing country country: 98
drawing country country: 98
drawing country country: 98
drawing country country: 98
drawing country country: 98
drawing country country: 99
drawing country country: 99
drawing country country: 99
drawing country country: 99
drawing country country: 99
drawing country country: 100
drawing country country: 100
drawing country country: 100
drawing country country: 100
drawing country country: 100
drawing country country: 101
drawing country country: 101
drawing country country: 101
drawing country country: 101
drawing country country: 101
drawing country country: 102
drawing country country: 102
drawing country country: 102
drawing country country: 102
drawing country country: 102
drawing country country: 103
drawing country country: 103
drawing country country: 103
drawing country country: 103
drawing country country: 103
drawing country country: 104
drawing country country: 104
drawing country country: 104
drawing country country: 104
drawing country country: 104
drawing country country: 105
drawing country country: 105
drawing country country: 105
drawing country country: 105
drawing country country: 105
drawing country country: 106
drawing country country: 106
drawing country country: 106
drawing country country: 106
drawing country country: 106
drawing country country: 107
drawing country country: 107
drawing country country: 107
drawing country country: 107
drawing country country: 107
drawing country country: 108
drawing country country: 108
drawing country country: 108
drawing country country: 108
drawing country country: 108
drawing country country: 109
drawing country country: 109
drawing country country: 109
drawing country country: 109
drawing country country: 109
drawing country country: 110
drawing country country: 110
drawing country country: 110
drawing country country: 110
drawing country country: 110
drawing country country: 111
drawing country country: 111
drawing country country: 111
drawing country country: 111
drawing country country: 111
drawing country country: 112
drawing country country: 112
drawing country country: 112
drawing country country: 112
drawing country country: 112
drawing country country: 113
drawing country country: 113
drawing country country: 113
drawing country country: 113
drawing country country: 113
drawing country country: 114
drawing country country: 114
drawing country country: 114
drawing country country: 114
drawing country country: 114
drawing country country: 115
drawing country country: 115
drawing country country: 115
drawing country country: 115
drawing country country: 115
drawing country country: 116
drawing country country: 116
drawing country country: 116
drawing country country: 116
drawing country country: 116
drawing country country: 117
drawing country country: 117
drawing country country: 117
drawing country country: 117
drawing country country: 117
drawing country country: 118
drawing country country: 118
drawing country country: 118
drawing country country: 118
drawing country country: 118
drawing country country: 119
drawing country country: 119
drawing country country: 119
drawing country country: 119
drawing country country: 119
drawing country country: 120
drawing country country: 120
drawing country country: 120
drawing country country: 120
drawing country country: 120
drawing country country: 121
drawing country country: 121
drawing country country: 121
drawing country country: 121
drawing country country: 121
drawing country country: 122
drawing country country: 122
drawing country country: 122
drawing country country: 122
drawing country country: 122
drawing country country: 123
drawing country country: 123
drawing country country: 123
drawing country country: 123
drawing country country: 123
drawing country country: 124
drawing country country: 124
drawing country country: 124
drawing country country: 124
drawing country country: 124
drawing country country: 125
drawing country country: 125
drawing country country: 125
drawing country country: 125
drawing country country: 125
drawing country country: 126
drawing country country: 126
drawing country country: 126
drawing country country: 126
drawing country country: 126
drawing country country: 127
drawing country country: 127
drawing country country: 127
drawing country country: 127
drawing country country: 127
drawing country country: 128
drawing country country: 128
drawing country country: 128
drawing country country: 128
drawing country country: 128
drawing country country: 129
drawing country country: 129
drawing country country: 129
drawing country country: 129
drawing country country: 129
drawing country country: 130
drawing country country: 130
drawing country country: 130
drawing country country: 130
drawing country country: 130
drawing country country: 131
drawing country country: 131
drawing country country: 131
drawing country country: 131
drawing country country: 131
drawing country country: 132
drawing country country: 132
drawing country country: 132
drawing country country: 132
drawing country country: 132
drawing country country: 133
drawing country country: 133
drawing country country: 133
drawing country country: 133
drawing country country: 133
drawing country country: 134
drawing country country: 134
drawing country country: 134
drawing country country: 134
drawing country country: 134
drawing country country: 135
drawing country country: 135
drawing country country: 135
drawing country country: 135
drawing country country: 135
drawing country country: 136
drawing country country: 136
drawing country country: 136
drawing country country: 136
drawing country country: 136
drawing country country: 137
drawing country country: 137
drawing country country: 137
drawing country country: 137
drawing country country: 137
drawing country country: 138
drawing country country: 138
drawing country country: 138
drawing country country: 138
drawing country country: 138
drawing country country: 139
drawing country country: 139
drawing country country: 139
drawing country country: 139
drawing country country: 139
drawing country country: 140
drawing country country: 140
drawing country country: 140
drawing country country: 140
drawing country country: 140
drawing country country: 141
drawing country country: 141
drawing country country: 141
drawing country country: 141
drawing country country: 141
drawing country country: 142
drawing country country: 142
drawing country country: 142
drawing country country: 142
drawing country country: 142
drawing country country: 143
drawing country country: 143
drawing country country: 143
drawing country country: 143
drawing country country: 143
drawing country country: 144
drawing country country: 144
drawing country country: 144
drawing country country: 144
drawing country country: 144
drawing country country: 145
drawing country country: 145
drawing country country: 145
drawing country country: 145
drawing country country: 145
drawing country country: 146
drawing country country: 146
drawing country country: 146
drawing country country: 146
drawing country country: 146
drawing country country: 147
drawing country country: 147
drawing country country: 147
drawing country country: 147
drawing country country: 147
drawing country country: 148
drawing country country: 148
drawing country country: 148
drawing country country: 148
drawing country country: 148
drawing country country: 149
drawing country country: 149
drawing country country: 149
drawing country country: 149
drawing country country: 149
drawing country country: 150
drawing country country: 150
drawing country country: 150
drawing country country: 150
drawing country country: 150
drawing country country: 151
drawing country country: 151
drawing country country: 151
drawing country country: 151
drawing country country: 151
drawing country country: 152
drawing country country: 152
drawing country country: 152
drawing country country: 152
drawing country country: 152
drawing country country: 153
drawing country country: 153
drawing country country: 153
drawing country country: 153
drawing country country: 153
drawing country country: 154
drawing country country: 154
drawing country country: 154
drawing country country: 154
drawing country country: 154
drawing country country: 155
drawing country country: 155
drawing country country: 155
drawing country country: 155
drawing country country: 155
drawing country country: 156
drawing country country: 156
drawing country country: 156
drawing country country: 156
drawing country country: 156
drawing country country: 157
drawing country country: 157
drawing country country: 157
drawing country country: 157
drawing country country: 157
drawing country country: 158
drawing country country: 158
drawing country country: 158
drawing country country: 158
drawing country country: 158
drawing country country: 159
drawing country country: 159
drawing country country: 159
drawing country country: 159
drawing country country: 159
drawing country country: 160
drawing country country: 160
drawing country country: 160
drawing country country: 160
drawing country country: 160
drawing country country: 161
drawing country country: 161
drawing country country: 161
drawing country country: 161
drawing country country: 161
drawing country country: 162
drawing country country: 162
drawing country country: 162
drawing country country: 162
drawing country country: 162
number of observations will be reset to 162
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 162
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in older Stata
      formats)
file Results/PKOsim/re_model_1_1_o.dta saved

        inc |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,383       98.34       98.34
          1 |        395        1.66      100.00
------------+-----------------------------------
      Total |     23,778      100.00
Estimating random effect for outcome 2

Fitting fixed-effects model:

Iteration 0:   log likelihood = -1101.7167  
Iteration 1:   log likelihood = -658.28066  
Iteration 2:   log likelihood = -646.29577  
Iteration 3:   log likelihood =  -643.8884  
Iteration 4:   log likelihood =  -643.8177  
Iteration 5:   log likelihood = -643.81763  

Refining starting values:

Grid node 0:   log likelihood =          .
Grid node 1:   log likelihood = -3487.5562
Grid node 2:   log likelihood = -1840.1674
Grid node 3:   log likelihood = -1249.1068

Fitting full model:

Iteration 0:   log likelihood = -1249.1068  
Iteration 1:   log likelihood = -811.30948  
Iteration 2:   log likelihood = -663.84158  
Iteration 3:   log likelihood = -640.70191  
Iteration 4:   log likelihood = -637.78517  
Iteration 5:   log likelihood = -637.27334  
Iteration 6:   log likelihood = -637.25687  
Iteration 7:   log likelihood = -637.25685  

Mixed-effects logistic regression               Number of obs     =      7,591
Group variable:            gwno                 Number of groups  =        162

                                                Obs per group:
                                                              min =         20
                                                              avg =       46.9
                                                              max =         53

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(18)     =     623.36
Log likelihood = -637.25685                     Prob > chi2       =     0.0000
-------------------------------------------------------------------------------
          inc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
           c1 |     6.1312   2.973614     2.06   0.039      .303023    11.95938
           c2 |   9.319638   2.993067     3.11   0.002     3.453334    15.18594
        ltsc0 |   1.144847   1.074914     1.07   0.287    -.9619461     3.25164
           nc |   .9891265   .8925253     1.11   0.268     -.760191    2.738444
         ncc1 |   -.533764   .9336736    -0.57   0.568    -2.363731    1.296203
         ncc2 |  -.4003689   .9349568    -0.43   0.668    -2.232851    1.432113
        ltsnc |  -.0154769   .0846943    -0.18   0.855    -.1814747    .1505208
        ncts0 |   .2079218   .3522551     0.59   0.555    -.4824856    .8983292
         lpop |   .1691614   .0893534     1.89   0.058    -.0059681    .3442909
      lGDPcap |    .166944   .3382137     0.49   0.622    -.4959426    .8298306
   lGDPcap_c1 |  -.4683262   .3563899    -1.31   0.189    -1.166838    .2301852
   lGDPcap_c2 |  -.5306858    .360108    -1.47   0.141    -1.236485    .1751128
lGDPcap_ltsc0 |  -.2011311    .136013    -1.48   0.139    -.4677116    .0654494
   ltimeindep |  -.0930793   .1079302    -0.86   0.388    -.3046186      .11846
     lPKOtrad |  -.5381227   .5787526    -0.93   0.352    -1.672457    .5962116
    lPKOtrans |  -1.271354   .9460164    -1.34   0.179    -3.125511    .5828045
  llPKObudget |   .1017516   .1456615     0.70   0.485    -.1837396    .3872428
 lPKOneighbor |  -.6342788   .3228308    -1.96   0.049    -1.267016   -.0015421
        _cons |  -7.663967   2.955605    -2.59   0.010    -13.45685   -1.871088
--------------+----------------------------------------------------------------
gwno          |
    var(_cons)|   .3842877   .1823585                      .1516109     .974053
-------------------------------------------------------------------------------
LR test vs. logistic model: chibar2(01) = 13.12       Prob >= chibar2 = 0.0001
file randomeffectsmodel.ster saved
(output written to Results/PKOsim/re_model_1_2_o.tex)
(calculating posterior means of random effects)
(using 7 quadrature points)
(1931 missing values generated)
(23,616 observations deleted)
2 20 40 41 42 51 52 70 90 91 92 93 94 95 100 101 110 115 130 135 140 145 150 155 160 165 20
> 0 205 210 211 212 220 225 230 235 260 290 305 310 316 317 325 339 343 344 346 349 350 352
>  355 359 360 365 366 367 368 369 370 371 372 373 375 380 385 390 402 404 411 420 432 433 
> 434 435 436 437 438 439 450 451 452 461 471 475 481 482 483 484 490 500 501 510 516 517 5
> 20 522 530 531 540 541 551 552 553 560 565 570 571 572 580 581 590 600 615 616 620 625 63
> 0 640 645 651 652 660 663 666 670 678 690 692 694 696 698 700 701 702 703 704 705 710 712
>  713 731 732 740 750 760 770 771 775 780 790 800 811 812 816 820 830 840 850 900 910 920 
> 940 950
Random effects calculated for 162 countries
drawing country country: 1
drawing country country: 1
drawing country country: 1
drawing country country: 1
drawing country country: 1
drawing country country: 2
drawing country country: 2
drawing country country: 2
drawing country country: 2
drawing country country: 2
drawing country country: 3
drawing country country: 3
drawing country country: 3
drawing country country: 3
drawing country country: 3
drawing country country: 4
drawing country country: 4
drawing country country: 4
drawing country country: 4
drawing country country: 4
drawing country country: 5
drawing country country: 5
drawing country country: 5
drawing country country: 5
drawing country country: 5
drawing country country: 6
drawing country country: 6
drawing country country: 6
drawing country country: 6
drawing country country: 6
drawing country country: 7
drawing country country: 7
drawing country country: 7
drawing country country: 7
drawing country country: 7
drawing country country: 8
drawing country country: 8
drawing country country: 8
drawing country country: 8
drawing country country: 8
drawing country country: 9
drawing country country: 9
drawing country country: 9
drawing country country: 9
drawing country country: 9
drawing country country: 10
drawing country country: 10
drawing country country: 10
drawing country country: 10
drawing country country: 10
drawing country country: 11
drawing country country: 11
drawing country country: 11
drawing country country: 11
drawing country country: 11
drawing country country: 12
drawing country country: 12
drawing country country: 12
drawing country country: 12
drawing country country: 12
drawing country country: 13
drawing country country: 13
drawing country country: 13
drawing country country: 13
drawing country country: 13
drawing country country: 14
drawing country country: 14
drawing country country: 14
drawing country country: 14
drawing country country: 14
drawing country country: 15
drawing country country: 15
drawing country country: 15
drawing country country: 15
drawing country country: 15
drawing country country: 16
drawing country country: 16
drawing country country: 16
drawing country country: 16
drawing country country: 16
drawing country country: 17
drawing country country: 17
drawing country country: 17
drawing country country: 17
drawing country country: 17
drawing country country: 18
drawing country country: 18
drawing country country: 18
drawing country country: 18
drawing country country: 18
drawing country country: 19
drawing country country: 19
drawing country country: 19
drawing country country: 19
drawing country country: 19
drawing country country: 20
drawing country country: 20
drawing country country: 20
drawing country country: 20
drawing country country: 20
drawing country country: 21
drawing country country: 21
drawing country country: 21
drawing country country: 21
drawing country country: 21
drawing country country: 22
drawing country country: 22
drawing country country: 22
drawing country country: 22
drawing country country: 22
drawing country country: 23
drawing country country: 23
drawing country country: 23
drawing country country: 23
drawing country country: 23
drawing country country: 24
drawing country country: 24
drawing country country: 24
drawing country country: 24
drawing country country: 24
drawing country country: 25
drawing country country: 25
drawing country country: 25
drawing country country: 25
drawing country country: 25
drawing country country: 26
drawing country country: 26
drawing country country: 26
drawing country country: 26
drawing country country: 26
drawing country country: 27
drawing country country: 27
drawing country country: 27
drawing country country: 27
drawing country country: 27
drawing country country: 28
drawing country country: 28
drawing country country: 28
drawing country country: 28
drawing country country: 28
drawing country country: 29
drawing country country: 29
drawing country country: 29
drawing country country: 29
drawing country country: 29
drawing country country: 30
drawing country country: 30
drawing country country: 30
drawing country country: 30
drawing country country: 30
drawing country country: 31
drawing country country: 31
drawing country country: 31
drawing country country: 31
drawing country country: 31
drawing country country: 32
drawing country country: 32
drawing country country: 32
drawing country country: 32
drawing country country: 32
drawing country country: 33
drawing country country: 33
drawing country country: 33
drawing country country: 33
drawing country country: 33
drawing country country: 34
drawing country country: 34
drawing country country: 34
drawing country country: 34
drawing country country: 34
drawing country country: 35
drawing country country: 35
drawing country country: 35
drawing country country: 35
drawing country country: 35
drawing country country: 36
drawing country country: 36
drawing country country: 36
drawing country country: 36
drawing country country: 36
drawing country country: 37
drawing country country: 37
drawing country country: 37
drawing country country: 37
drawing country country: 37
drawing country country: 38
drawing country country: 38
drawing country country: 38
drawing country country: 38
drawing country country: 38
drawing country country: 39
drawing country country: 39
drawing country country: 39
drawing country country: 39
drawing country country: 39
drawing country country: 40
drawing country country: 40
drawing country country: 40
drawing country country: 40
drawing country country: 40
drawing country country: 41
drawing country country: 41
drawing country country: 41
drawing country country: 41
drawing country country: 41
drawing country country: 42
drawing country country: 42
drawing country country: 42
drawing country country: 42
drawing country country: 42
drawing country country: 43
drawing country country: 43
drawing country country: 43
drawing country country: 43
drawing country country: 43
drawing country country: 44
drawing country country: 44
drawing country country: 44
drawing country country: 44
drawing country country: 44
drawing country country: 45
drawing country country: 45
drawing country country: 45
drawing country country: 45
drawing country country: 45
drawing country country: 46
drawing country country: 46
drawing country country: 46
drawing country country: 46
drawing country country: 46
drawing country country: 47
drawing country country: 47
drawing country country: 47
drawing country country: 47
drawing country country: 47
drawing country country: 48
drawing country country: 48
drawing country country: 48
drawing country country: 48
drawing country country: 48
drawing country country: 49
drawing country country: 49
drawing country country: 49
drawing country country: 49
drawing country country: 49
drawing country country: 50
drawing country country: 50
drawing country country: 50
drawing country country: 50
drawing country country: 50
drawing country country: 51
drawing country country: 51
drawing country country: 51
drawing country country: 51
drawing country country: 51
drawing country country: 52
drawing country country: 52
drawing country country: 52
drawing country country: 52
drawing country country: 52
drawing country country: 53
drawing country country: 53
drawing country country: 53
drawing country country: 53
drawing country country: 53
drawing country country: 54
drawing country country: 54
drawing country country: 54
drawing country country: 54
drawing country country: 54
drawing country country: 55
drawing country country: 55
drawing country country: 55
drawing country country: 55
drawing country country: 55
drawing country country: 56
drawing country country: 56
drawing country country: 56
drawing country country: 56
drawing country country: 56
drawing country country: 57
drawing country country: 57
drawing country country: 57
drawing country country: 57
drawing country country: 57
drawing country country: 58
drawing country country: 58
drawing country country: 58
drawing country country: 58
drawing country country: 58
drawing country country: 59
drawing country country: 59
drawing country country: 59
drawing country country: 59
drawing country country: 59
drawing country country: 60
drawing country country: 60
drawing country country: 60
drawing country country: 60
drawing country country: 60
drawing country country: 61
drawing country country: 61
drawing country country: 61
drawing country country: 61
drawing country country: 61
drawing country country: 62
drawing country country: 62
drawing country country: 62
drawing country country: 62
drawing country country: 62
drawing country country: 63
drawing country country: 63
drawing country country: 63
drawing country country: 63
drawing country country: 63
drawing country country: 64
drawing country country: 64
drawing country country: 64
drawing country country: 64
drawing country country: 64
drawing country country: 65
drawing country country: 65
drawing country country: 65
drawing country country: 65
drawing country country: 65
drawing country country: 66
drawing country country: 66
drawing country country: 66
drawing country country: 66
drawing country country: 66
drawing country country: 67
drawing country country: 67
drawing country country: 67
drawing country country: 67
drawing country country: 67
drawing country country: 68
drawing country country: 68
drawing country country: 68
drawing country country: 68
drawing country country: 68
drawing country country: 69
drawing country country: 69
drawing country country: 69
drawing country country: 69
drawing country country: 69
drawing country country: 70
drawing country country: 70
drawing country country: 70
drawing country country: 70
drawing country country: 70
drawing country country: 71
drawing country country: 71
drawing country country: 71
drawing country country: 71
drawing country country: 71
drawing country country: 72
drawing country country: 72
drawing country country: 72
drawing country country: 72
drawing country country: 72
drawing country country: 73
drawing country country: 73
drawing country country: 73
drawing country country: 73
drawing country country: 73
drawing country country: 74
drawing country country: 74
drawing country country: 74
drawing country country: 74
drawing country country: 74
drawing country country: 75
drawing country country: 75
drawing country country: 75
drawing country country: 75
drawing country country: 75
drawing country country: 76
drawing country country: 76
drawing country country: 76
drawing country country: 76
drawing country country: 76
drawing country country: 77
drawing country country: 77
drawing country country: 77
drawing country country: 77
drawing country country: 77
drawing country country: 78
drawing country country: 78
drawing country country: 78
drawing country country: 78
drawing country country: 78
drawing country country: 79
drawing country country: 79
drawing country country: 79
drawing country country: 79
drawing country country: 79
drawing country country: 80
drawing country country: 80
drawing country country: 80
drawing country country: 80
drawing country country: 80
drawing country country: 81
drawing country country: 81
drawing country country: 81
drawing country country: 81
drawing country country: 81
drawing country country: 82
drawing country country: 82
drawing country country: 82
drawing country country: 82
drawing country country: 82
drawing country country: 83
drawing country country: 83
drawing country country: 83
drawing country country: 83
drawing country country: 83
drawing country country: 84
drawing country country: 84
drawing country country: 84
drawing country country: 84
drawing country country: 84
drawing country country: 85
drawing country country: 85
drawing country country: 85
drawing country country: 85
drawing country country: 85
drawing country country: 86
drawing country country: 86
drawing country country: 86
drawing country country: 86
drawing country country: 86
drawing country country: 87
drawing country country: 87
drawing country country: 87
drawing country country: 87
drawing country country: 87
drawing country country: 88
drawing country country: 88
drawing country country: 88
drawing country country: 88
drawing country country: 88
drawing country country: 89
drawing country country: 89
drawing country country: 89
drawing country country: 89
drawing country country: 89
drawing country country: 90
drawing country country: 90
drawing country country: 90
drawing country country: 90
drawing country country: 90
drawing country country: 91
drawing country country: 91
drawing country country: 91
drawing country country: 91
drawing country country: 91
drawing country country: 92
drawing country country: 92
drawing country country: 92
drawing country country: 92
drawing country country: 92
drawing country country: 93
drawing country country: 93
drawing country country: 93
drawing country country: 93
drawing country country: 93
drawing country country: 94
drawing country country: 94
drawing country country: 94
drawing country country: 94
drawing country country: 94
drawing country country: 95
drawing country country: 95
drawing country country: 95
drawing country country: 95
drawing country country: 95
drawing country country: 96
drawing country country: 96
drawing country country: 96
drawing country country: 96
drawing country country: 96
drawing country country: 97
drawing country country: 97
drawing country country: 97
drawing country country: 97
drawing country country: 97
drawing country country: 98
drawing country country: 98
drawing country country: 98
drawing country country: 98
drawing country country: 98
drawing country country: 99
drawing country country: 99
drawing country country: 99
drawing country country: 99
drawing country country: 99
drawing country country: 100
drawing country country: 100
drawing country country: 100
drawing country country: 100
drawing country country: 100
drawing country country: 101
drawing country country: 101
drawing country country: 101
drawing country country: 101
drawing country country: 101
drawing country country: 102
drawing country country: 102
drawing country country: 102
drawing country country: 102
drawing country country: 102
drawing country country: 103
drawing country country: 103
drawing country country: 103
drawing country country: 103
drawing country country: 103
drawing country country: 104
drawing country country: 104
drawing country country: 104
drawing country country: 104
drawing country country: 104
drawing country country: 105
drawing country country: 105
drawing country country: 105
drawing country country: 105
drawing country country: 105
drawing country country: 106
drawing country country: 106
drawing country country: 106
drawing country country: 106
drawing country country: 106
drawing country country: 107
drawing country country: 107
drawing country country: 107
drawing country country: 107
drawing country country: 107
drawing country country: 108
drawing country country: 108
drawing country country: 108
drawing country country: 108
drawing country country: 108
drawing country country: 109
drawing country country: 109
drawing country country: 109
drawing country country: 109
drawing country country: 109
drawing country country: 110
drawing country country: 110
drawing country country: 110
drawing country country: 110
drawing country country: 110
drawing country country: 111
drawing country country: 111
drawing country country: 111
drawing country country: 111
drawing country country: 111
drawing country country: 112
drawing country country: 112
drawing country country: 112
drawing country country: 112
drawing country country: 112
drawing country country: 113
drawing country country: 113
drawing country country: 113
drawing country country: 113
drawing country country: 113
drawing country country: 114
drawing country country: 114
drawing country country: 114
drawing country country: 114
drawing country country: 114
drawing country country: 115
drawing country country: 115
drawing country country: 115
drawing country country: 115
drawing country country: 115
drawing country country: 116
drawing country country: 116
drawing country country: 116
drawing country country: 116
drawing country country: 116
drawing country country: 117
drawing country country: 117
drawing country country: 117
drawing country country: 117
drawing country country: 117
drawing country country: 118
drawing country country: 118
drawing country country: 118
drawing country country: 118
drawing country country: 118
drawing country country: 119
drawing country country: 119
drawing country country: 119
drawing country country: 119
drawing country country: 119
drawing country country: 120
drawing country country: 120
drawing country country: 120
drawing country country: 120
drawing country country: 120
drawing country country: 121
drawing country country: 121
drawing country country: 121
drawing country country: 121
drawing country country: 121
drawing country country: 122
drawing country country: 122
drawing country country: 122
drawing country country: 122
drawing country country: 122
drawing country country: 123
drawing country country: 123
drawing country country: 123
drawing country country: 123
drawing country country: 123
drawing country country: 124
drawing country country: 124
drawing country country: 124
drawing country country: 124
drawing country country: 124
drawing country country: 125
drawing country country: 125
drawing country country: 125
drawing country country: 125
drawing country country: 125
drawing country country: 126
drawing country country: 126
drawing country country: 126
drawing country country: 126
drawing country country: 126
drawing country country: 127
drawing country country: 127
drawing country country: 127
drawing country country: 127
drawing country country: 127
drawing country country: 128
drawing country country: 128
drawing country country: 128
drawing country country: 128
drawing country country: 128
drawing country country: 129
drawing country country: 129
drawing country country: 129
drawing country country: 129
drawing country country: 129
drawing country country: 130
drawing country country: 130
drawing country country: 130
drawing country country: 130
drawing country country: 130
drawing country country: 131
drawing country country: 131
drawing country country: 131
drawing country country: 131
drawing country country: 131
drawing country country: 132
drawing country country: 132
drawing country country: 132
drawing country country: 132
drawing country country: 132
drawing country country: 133
drawing country country: 133
drawing country country: 133
drawing country country: 133
drawing country country: 133
drawing country country: 134
drawing country country: 134
drawing country country: 134
drawing country country: 134
drawing country country: 134
drawing country country: 135
drawing country country: 135
drawing country country: 135
drawing country country: 135
drawing country country: 135
drawing country country: 136
drawing country country: 136
drawing country country: 136
drawing country country: 136
drawing country country: 136
drawing country country: 137
drawing country country: 137
drawing country country: 137
drawing country country: 137
drawing country country: 137
drawing country country: 138
drawing country country: 138
drawing country country: 138
drawing country country: 138
drawing country country: 138
drawing country country: 139
drawing country country: 139
drawing country country: 139
drawing country country: 139
drawing country country: 139
drawing country country: 140
drawing country country: 140
drawing country country: 140
drawing country country: 140
drawing country country: 140
drawing country country: 141
drawing country country: 141
drawing country country: 141
drawing country country: 141
drawing country country: 141
drawing country country: 142
drawing country country: 142
drawing country country: 142
drawing country country: 142
drawing country country: 142
drawing country country: 143
drawing country country: 143
drawing country country: 143
drawing country country: 143
drawing country country: 143
drawing country country: 144
drawing country country: 144
drawing country country: 144
drawing country country: 144
drawing country country: 144
drawing country country: 145
drawing country country: 145
drawing country country: 145
drawing country country: 145
drawing country country: 145
drawing country country: 146
drawing country country: 146
drawing country country: 146
drawing country country: 146
drawing country country: 146
drawing country country: 147
drawing country country: 147
drawing country country: 147
drawing country country: 147
drawing country country: 147
drawing country country: 148
drawing country country: 148
drawing country country: 148
drawing country country: 148
drawing country country: 148
drawing country country: 149
drawing country country: 149
drawing country country: 149
drawing country country: 149
drawing country country: 149
drawing country country: 150
drawing country country: 150
drawing country country: 150
drawing country country: 150
drawing country country: 150
drawing country country: 151
drawing country country: 151
drawing country country: 151
drawing country country: 151
drawing country country: 151
drawing country country: 152
drawing country country: 152
drawing country country: 152
drawing country country: 152
drawing country country: 152
drawing country country: 153
drawing country country: 153
drawing country country: 153
drawing country country: 153
drawing country country: 153
drawing country country: 154
drawing country country: 154
drawing country country: 154
drawing country country: 154
drawing country country: 154
drawing country country: 155
drawing country country: 155
drawing country country: 155
drawing country country: 155
drawing country country: 155
drawing country country: 156
drawing country country: 156
drawing country country: 156
drawing country country: 156
drawing country country: 156
drawing country country: 157
drawing country country: 157
drawing country country: 157
drawing country country: 157
drawing country country: 157
drawing country country: 158
drawing country country: 158
drawing country country: 158
drawing country country: 158
drawing country country: 158
drawing country country: 159
drawing country country: 159
drawing country country: 159
drawing country country: 159
drawing country country: 159
drawing country country: 160
drawing country country: 160
drawing country country: 160
drawing country country: 160
drawing country country: 160
drawing country country: 161
drawing country country: 161
drawing country country: 161
drawing country country: 161
drawing country country: 161
drawing country country: 162
drawing country country: 162
drawing country country: 162
drawing country country: 162
drawing country country: 162
number of observations will be reset to 162
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 162
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in older Stata
      formats)
file Results/PKOsim/re_model_1_2_o.dta saved

include_re[3,1]
    c1
r1   1
r2   1
r3   1
drawrandom done 
(15,701 observations deleted)
file PredictionPKO_PKOsim_m1_s1_esttemp.dta saved
Draw number: 11
IDEP; lGDPcap; lv(lGDPcap) 
Endogenous variable constructed statement: IDEP; lGDPcap; lv(lGDPcap)  + (-.0232384*lv(lGDP
> cap))  + (.0160339*lv(ltimeindep))  + (-.0220856*lv(c1))  + (-.0375699*lv(c2))  + (-6.94e
> -06*lv(ltsc0))  + (-.0073067*lv(nc))  + (.0081603*lv(ncc1))  + (.0159668*lv(ncc2))  + (-.
> 0197959*lv(lpop))  + (.0540174*lv(lPKOtrad))  + (.0698832*lv(lPKOtrans))  + (-.0071373*lv
> (llPKObudget))  + (.0005389*lv(llPKObudgsq))  + (.0178519*lv(lPKOneighbor))  + (-.0014623
> *lv(lGDPcapPKOtrans))  + (-.003554*lv(lGDPcapPKOtrad))  + lv(fixedeffect)
parameter file to be used: parameters_baseline_1_1.txt
(1 var, 110 obs)
number of observations (_N) was 110, now 113
(note: file /Users/Havard/Dropbox/Collaborations/PKO/Paper/Replication package/Parameters/p
> arameters_PKOsim_1_1.txt not found)
(0 observations deleted)
Before Simulator_test. para outfile:  /Users/Havard/Dropbox/Collaborations/PKO/Paper/Replic
> ation package/Parameters/parameters_PKOsim_1_1.txt
top of simulator_test
here
Betaline: 1
//Parameters for estimation command and simulation
// SIMPLE MODEL
UNITID; gwno
TIMEID; year
DEP; conflict
//When using nv() function it has to be calculated before use
SUPPVAR; timeinstatus; if(lv(conflict)==nv(conflict)|lv(timeinstatus) + 1|1)
SUPPVAR; lts; ln(lv(timeinstatus))
SUPPVAR; fixedeffect; (lhv(fixedeffect))
SUPPVAR; c0; if(nv(conflict)==0.0|1|0)
SUPPVAR; c0_nl; if(nv(conflict)==0.0|1|0)
SUPPVAR; nc2l; if(lv(nc)==1.0|1|0)
SUPPVAR; timeinstatusnc; if(lv(nc)==lv(nc2l)|lv(timeinstatusnc) + 1|1)
SUPPVAR; dummyconflict; if(nv(conflict)>=1.0|1|0)
SUPPVAR; nopko; (lhv(nopko))
SUPPVAR; llPKObudgsq; lv(llPKObudget)*lv(llPKObudget)
SUPPVAR; PKObudget; exp(lv(llPKObudget))
SUPPVAR; GDPcapSSP2; exp(lv(lGDPcap))
//SUPPVAR; lGDPcapPKOtrans; lv(lPKOtrans)*lv(lGDPcap)
//SUPPVAR; lGDPcapPKOtrad; lv(lPKOtrad)*lv(lGDPcap)
//SUPPVAR; lGDPcapllPKObudget; lv(llPKObudget)*lv(lGDPcap)
SUPPVAR; lGDPcapllPKObudgsq; lv(llPKObudgsq)*lv(lGDPcap)
IDEP; c1 lagged; if(nv(conflict)==1.0|1|0)
IDEP; c2 lagged; if(nv(conflict)==2.0|1|0)
IDEP; ltsc0; nv(lts)*lv(c0)
IDEP; nc; if(checkforedgevalue(dummyconflict|1.0)==1.0|1|0)
IDEP; ncc1; nv(nc)*nv(c1)
IDEP; ncc2; nv(nc)*nv(c2)
IDEP; ltsnc; ln(nv(timeinstatusnc))
IDEP; ncts0; nv(ltsc0)*(1-nv(nc))
IDEP; lpop lagged; lhv(lpop)
//IDEP; lpop_c1 lagged; lhv(lpop)*lv(c1)
//IDEP; lpop_c2 lagged; lhv(lpop)*lv(c2)
//IDEP; lpop_ltsc0 lagged; nv(lpop)*lv(ltsc0)
IDEP; lGDPcap; lv(lGDPcap)  + (-.0232384*lv(lGDPcap))  + (.0160339*lv(ltimeindep))  + (-.02
> 20856*lv(c1))  + (-.0375699*lv(c2))  + (-6.94e-06*lv(ltsc0))  + (-.0073067*lv(nc))  + (.0
> 081603*lv(ncc1))  + (.0159668*lv(ncc2))  + (-.0197959*lv(lpop))  + (.0540174*lv(lPKOtrad)
> )  + (.0698832*lv(lPKOtrans))  + (-.0071373*lv(llPKObudget))  + (.0005389*lv(llPKObudgsq)
> )  + (.0178519*lv(lPKOneighbor))  + (-.0014623*lv(lGDPcapPKOtrans))  + (-.003554*lv(lGDPc
> apPKOtrad))  + lv(fixedeffect)
IDEP; lGDPcap_c1 lagged; lv(lGDPcap)*nv(c1)
IDEP; lGDPcap_c2 lagged; lv(lGDPcap)*nv(c2)
IDEP; lGDPcap_ltsc0 lagged; lv(lGDPcap)*nv(ltsc0)
IDEP; ltimeindep; lhv(ltimeindep)
//IDEP; lGDPcapPKOtrans; lv(lPKOtrans)*lv(lGDPcap)
//IDEP; lGDPcapPKOtrad; lv(lPKOtrad)*lv(lGDPcap)
//IDEP; lGDPcapllPKObudget; lv(llPKObudget)*lv(lGDPcap)
//IDEP; dec90; lhv(dec90)
//IDEP; dec60_lpop; nv(lpop)*lv(dec60)
//IDEP; dec70_lpop; nv(lpop)*lv(dec70)
//IDEP; dec80_lpop; nv(lpop)*lv(dec80)
//IDEP; dec90_lpop; nv(lpop)*lv(dec90)
//IDEP; dec60_lGDPcap; nv(lGDPcap)*lv(dec60)
//IDEP; dec70_lGDPcap; nv(lGDPcap)*lv(dec70)
//IDEP; dec80_lGDPcap; nv(lGDPcap)*lv(dec80)
//IDEP; dec90_lGDPcap; nv(lGDPcap)*lv(dec90)
//IDEP; reg1; lhv(reg1)
//IDEP; reg2; lhv(reg2)
//IDEP; reg3; lhv(reg3)
//IDEP; reg4; lhv(reg4)
//IDEP; reg5; lhv(reg5)
//IDEP; reg6; lhv(reg6)
//IDEP; reg7; lhv(reg7)
//IDEP; reg8; lhv(reg8)
//IDEP; reg9; lhv(reg9)
//IDEP; polity2; lhv(polity2)
//IDEP; polity2sq; lhv(polity2sq)
//IDEP; polity2_c1; lhv(polity2_c1)
//IDEP; polity2sq_c1; lhv(polity2sq_c1)
//IDEP; polity2_c2; lhv(polity2_c2)
//IDEP; polity2sq_c2; lhv(polity2sq_c2)
//IDEP; polity2_GDPcap; lhv(polity2_GDPcap)
//IDEP; polity2sq_GDPcap; lhv(polity2sq_GDPcap)
//IDEP; proxregchange2_n_1; lhv(proxregchange2_n_1)
//IDEP; proxregchange2_n_2; lhv(proxregchange2_n_2)
//IDEP; proxregchange2_n_4; lhv(proxregchange2_n_4)
//IDEP; proxregchange2_s_1; lhv(proxregchange2_s_1)
//IDEP; proxregchange2_s_2; lhv(proxregchange2_s_2)
//IDEP; proxregchange2_s_4; lhv(proxregchange2_s_4)
//IDEP; proxregchange3_n_1; lhv(proxregchange3_n_1)
//IDEP; proxregchange3_n_2; lhv(proxregchange3_n_2)
//IDEP; proxregchange3_n_4; lhv(proxregchange3_n_4)
//IDEP; proxregchange3_s_1; lhv(proxregchange3_s_1)
//IDEP; proxregchange3_s_2; lhv(proxregchange3_s_2)
//IDEP; proxregchange3_s_4; lhv(proxregchange3_s_4)
//IDEP; proxregchange4_n_1; lhv(proxregchange4_n_1)
//IDEP; proxregchange4_n_2; lhv(proxregchange4_n_2)
//IDEP; proxregchange4_n_4; lhv(proxregchange4_n_4)
//IDEP; proxregchange4_s_1; lhv(proxregchange4_s_1)
//IDEP; proxregchange4_s_2; lhv(proxregchange4_s_2)
//IDEP; proxregchange4_s_4; lhv(proxregchange4_s_4)
//IDEP; PolityStdAuth; lhv(PolityStdAuth)
//IDEP; NA_elect; lhv(NA_elect)
//IDEP; maj_elect; lhv(maj_elect)
//IDEP; pr_elect; lhv(pr_elect)
//IDEP; no_elect; lhv(no_elect)
IDEP; lPKOtrad; lhv(lPKOtrad)
IDEP; lPKOtrans; lhv(lPKOtrans)
IDEP; llPKObudget; lhv(llPKObudget)
//IDEP; llPKObudgsq; lhv(llPKObudgsq)
IDEP; lPKOneighbor; lhv(lPKOneighbor)
//IDEP; DS_ord_1; lhv(DS_ord_1)
//IDEP; DS_ord_2; lhv(DS_ord_2)
//IDEP; DS_ord_3; lhv(DS_ord_3)
//IDEP; DS_ord_4; lhv(DS_ord_4)
//IDEP; PKOprevious; lhv(PKOprevious)
IDEP; random_1; lhv(random_1)
IDEP; random_2; lhv(random_2)
LINKS;neighbors
IFS; if year >= 1950 & year <= 2013
BETADRAWS; 1
SPLIT; none
ITERATIONS; 15
STARTTIME; 2000
LOGFILE; Log_PKO_sim_insamplev12.txt
SIMULATIONS; 10
ENDPARAMS; baseoutcome(0)
RESULTFILE; C:\PredictionTemp\PKOsim/Res_sim_1_1_1_1.txt
Testing data string length
328
(162 missing values generated)
(162 missing values generated)
(162 missing values generated)
(162 missing values generated)
(162 missing values generated)
(162 missing values generated)

. mlogit conflict  lc1 lc2 ltsc0 nc ncc1 ncc2 ltsnc ncts0 llpop lGDPcap llGDPcap_c1 llGDPca
> p_c2 llGDPcap_ltsc0 ltimeindep lPKOtrad lPKOtrans llPKObudget lPKOneighbor random_1 rando
> m_2 if year >= 1950 & year <= 2013 ,baseoutcome(0)

Iteration 0:   log likelihood = -4208.1138
Iteration 1:   log likelihood = -3042.7782
Iteration 2:   log likelihood = -3020.6684  (backed up)
Iteration 3:   log likelihood =  -2625.381
Iteration 4:   log likelihood = -2355.8186
Iteration 5:   log likelihood = -2294.7545
Iteration 6:   log likelihood = -1925.0956
Iteration 7:   log likelihood = -1809.6185
Iteration 8:   log likelihood = -1800.1059
Iteration 9:   log likelihood = -1799.6528
Iteration 10:  log likelihood = -1799.6505

Multinomial logistic regression                   Number of obs   =       7591
                                                  LR chi2(40)     =    4816.93
                                                  Prob > chi2     =     0.0000
Log likelihood = -1799.6505                       Pseudo R2       =     0.5723

------------------------------------------------------------------------------
    conflict |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
         lc1 |  -3.066209   .8930373    -3.43   0.001     -4.81653   -1.315888
         lc2 |   -.855239   1.578496    -0.54   0.588    -3.949035    2.238557
       ltsc0 |  -.4117133    .101707    -4.05   0.000    -.6110553   -.2123713
          nc |  -1.177495   .2089029    -5.64   0.000    -1.586937   -.7680527
        ncc1 |   2.224903   .2194935    10.14   0.000     1.794703    2.655102
        ncc2 |   2.379917   .3685674     6.46   0.000     1.657538    3.102296
       ltsnc |   .0109452   .0515369     0.21   0.832    -.0900654    .1119557
       ncts0 |  -.6620211   .1014907    -6.52   0.000    -.8609392   -.4631031
       llpop |   .3147091   .0421149     7.47   0.000     .2321655    .3972527
     lGDPcap |  -.4584674   .0781636    -5.87   0.000    -.6116652   -.3052696
 llGDPcap_c1 |   .5593688   .1175411     4.76   0.000     .3289925    .7897451
 llGDPcap_c2 |   .3003165   .2072856     1.45   0.147    -.1059558    .7065889
llGDPcap_l~0 |   .0223389    .010249     2.18   0.029     .0022513    .0424265
  ltimeindep |    .202138   .0571466     3.54   0.000     .0901328    .3141433
    lPKOtrad |   .0287718   .4077047     0.07   0.944    -.7703147    .8278583
   lPKOtrans |   -.167692   .6716552    -0.25   0.803    -1.484112    1.148728
 llPKObudget |   .0124779   .1071743     0.12   0.907    -.1975799    .2225357
lPKOneighbor |   -.208528   .1972243    -1.06   0.290    -.5950805    .1780244
    random_1 |   1.190386   .0992674    11.99   0.000     .9958252    1.384946
    random_2 |   .3673546   .0967556     3.80   0.000     .1777171    .5569921
       _cons |  -1.585269   .6499115    -2.44   0.015    -2.859072   -.3114662
-------------+----------------------------------------------------------------
2            |
         lc1 |  -.3460479   1.513093    -0.23   0.819    -3.311656     2.61956
         lc2 |   3.155684   1.881954     1.68   0.094     -.532878    6.844246
       ltsc0 |  -.3386072   .2120299    -1.60   0.110    -.7541782    .0769638
          nc |   -2.26867   .4654242    -4.87   0.000    -3.180885   -1.356456
        ncc1 |   2.774691    .477107     5.82   0.000     1.839579    3.709804
        ncc2 |    5.22831   .5310365     9.85   0.000     4.187498    6.269123
       ltsnc |   .0085999   .0781467     0.11   0.912    -.1445649    .1617647
       ncts0 |  -1.026472   .2482296    -4.14   0.000    -1.512993   -.5399509
       llpop |   .3865312   .0671314     5.76   0.000     .2549561    .5181063
     lGDPcap |  -.3101851   .1530629    -2.03   0.043    -.6101829   -.0101872
 llGDPcap_c1 |   .1541092   .2010245     0.77   0.443    -.2398915    .5481099
 llGDPcap_c2 |  -.1454174   .2506385    -0.58   0.562    -.6366598     .345825
llGDPcap_l~0 |    .008959   .0170146     0.53   0.599    -.0243891     .042307
  ltimeindep |   .0203708   .0868198     0.23   0.814    -.1497928    .1905344
    lPKOtrad |  -.4662038   .5772383    -0.81   0.419     -1.59757    .6651626
   lPKOtrans |  -1.330199   .9389332    -1.42   0.157    -3.170474    .5100762
 llPKObudget |   .0604088   .1482047     0.41   0.684    -.2300672    .3508847
lPKOneighbor |  -.8604239   .3196401    -2.69   0.007    -1.486907   -.2339409
    random_1 |   .5282937   .1526725     3.46   0.001     .2290611    .8275262
    random_2 |   1.195173   .1454171     8.22   0.000     .9101606    1.480185
       _cons |  -3.535651   1.248079    -2.83   0.005    -5.981841   -1.089461
------------------------------------------------------------------------------
(conflict==0 is the base outcome)

. 
end of do-file
Data:
gwno year conflict timeinstatus lts fixedeffect c0 c0_nl nc2l timeinstatusnc dummyconflict 
> nopko llPKObudgsq PKObudget GDPcapSSP2 lGDPcapllPKObudgsq c1 c2 ltsc0 nc ncc1 ncc2 ltsnc 
> ncts0 lpop lGDPcap lGDPcap_c1 lGDPcap_c2 lGDPcap_ltsc0 ltimeindep lPKOtrad lPKOtrans llPK
> Obudget lPKOneighbor random_1 random_2 splitpoint neighbors
/Users/Havard/Dropbox/Collaborations/PKO/Paper/Replication package/Sim/Program

file estimationdata.dta saved
Expressions:
if(lv(conflict)==nv(conflict)|lv(timeinstatus) + 1|1)ln(lv(timeinstatus))(lhv(fixedeffect))
> if(nv(conflict)==0.0|1|0)if(nv(conflict)==0.0|1|0)if(lv(nc)==1.0|1|0)if(lv(nc)==lv(nc2l)|
> lv(timeinstatusnc) + 1|1)if(nv(conflict)>=1.0|1|0)(lhv(nopko))lv(llPKObudget)*lv(llPKObud
> get)exp(lv(llPKObudget))exp(lv(lGDPcap))lv(lPKOtrans)*lv(lGDPcap)lv(lPKOtrad)*lv(lGDPcap)
> lv(llPKObudget)*lv(lGDPcap)lv(llPKObudgsq)*lv(lGDPcap)if(nv(conflict)==1.0|1|0)if(nv(conf
> lict)==2.0|1|0)nv(lts)*lv(c0)if(checkforedgevalue(dummyconflict|1.0)==1.0|1|0)nv(nc)*nv(c
> 1)nv(nc)*nv(c2)ln(nv(timeinstatusnc))nv(ltsc0)*(1-nv(nc))lhv(lpop)lhv(lpop)*lv(c1)lhv(lpo
> p)*lv(c2)nv(lpop)*lv(ltsc0)lv(lGDPcap)  + (-.0232384*lv(lGDPcap))  + (.0160339*lv(ltimein
> dep))  + (-.0220856*lv(c1))  + (-.0375699*lv(c2))  + (-6.94e-06*lv(ltsc0))  + (-.0073067*
> lv(nc))  + (.0081603*lv(ncc1))  + (.0159668*lv(ncc2))  + (-.0197959*lv(lpop))  + (.054017
> 4*lv(lPKOtrad))  + (.0698832*lv(lPKOtrans))  + (-.0071373*lv(llPKObudget))  + (.0005389*l
> v(llPKObudgsq))  + (.0178519*lv(lPKOneighbor))  + (-.0014623*lv(lGDPcapPKOtrans))  + (-.0
> 03554*lv(lGDPcapPKOtrad))  + lv(fixedeffect)lv(lGDPcap)*nv(c1)lv(lGDPcap)*nv(c2)lv(lGDPca
> p)*nv(ltsc0)lhv(ltimeindep)lv(lPKOtrans)*lv(lGDPcap)lv(lPKOtrad)*lv(lGDPcap)lv(llPKObudge
> t)*lv(lGDPcap)lhv(dec90)nv(lpop)*lv(dec60)nv(lpop)*lv(dec70)nv(lpop)*lv(dec80)nv(lpop)*lv
> (dec90)nv(lGDPcap)*lv(dec60)nv(lGDPcap)*lv(dec70)nv(lGDPcap)*lv(dec80)nv(lGDPcap)*lv(dec9
> 0)lhv(reg1)lhv(reg2)lhv(reg3)lhv(reg4)lhv(reg5)lhv(reg6)lhv(reg7)lhv(reg8)lhv(reg9)lhv(po
> lity2)lhv(polity2sq)lhv(polity2_c1)lhv(polity2sq_c1)lhv(polity2_c2)lhv(polity2sq_c2)lhv(p
> olity2_GDPcap)lhv(polity2sq_GDPcap)lhv(proxregchange2_n_1)lhv(proxregchange2_n_2)lhv(prox
> regchange2_n_4)lhv(proxregchange2_s_1)lhv(proxregchange2_s_2)lhv(proxregchange2_s_4)lhv(p
> roxregchange3_n_1)lhv(proxregchange3_n_2)lhv(proxregchange3_n_4)lhv(proxregchange3_s_1)lh
> v(proxregchange3_s_2)lhv(proxregchange3_s_4)lhv(proxregchange4_n_1)lhv(proxregchange4_n_2
> )lhv(proxregchange4_n_4)lhv(proxregchange4_s_1)lhv(proxregchange4_s_2)lhv(proxregchange4_
> s_4)lhv(PolityStdAuth)lhv(NA_elect)lhv(maj_elect)lhv(pr_elect)lhv(no_elect)lhv(lPKOtrad)l
> hv(lPKOtrans)lhv(llPKObudget)lhv(llPKObudgsq)lhv(lPKOneighbor)lhv(DS_ord_1)lhv(DS_ord_2)l
> hv(DS_ord_3)lhv(DS_ord_4)lhv(PKOprevious)lhv(random_1)lhv(random_2)
After extraction of betas. Number of columns:
42
Current content of cmd string:
b42

. drawnorm b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b
> 23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 , n(1000) 
> cov(vcv) means(b)
(obs 1,000)

. 
end of do-file
Just before sim. Input parameters data, paramfile, resultfile, logfile:
gwno year conflict timeinstatus lts fixedeffect c0 c0_nl nc2l timeinstatusnc dummyconflict 
> nopko llPKObudgsq PKObudget GDPcapSSP2 lGDPcapllPKObudgsq c1 c2 ltsc0 nc ncc1 ncc2 ltsnc 
> ncts0 lpop lGDPcap lGDPcap_c1 lGDPcap_c2 lGDPcap_ltsc0 ltimeindep lPKOtrad lPKOtrans llPK
> Obudget lPKOneighbor random_1 random_2 splitpoint neighbors
/Users/Havard/Dropbox/Collaborations/PKO/Paper/Replication package/Parameters/parameters_PK
> Osim_1_1.txt
C:\PredictionTemp\PKOsim/Res_sim_1_1_1_1.txt
Log_PKO_sim_insamplev12.txt
/Users/Havard/Dropbox/Collaborations/PKO/Paper/Replication package/Sim/Program
unrecognized command
r(199);

end of do-file

r(199);

